{
  "id": "3dgs-cpp",
  "name": "3DGS.cpp",
  "version": "0.1.0",
  "description": "Cross-platform high-performance 3D Gaussian Splatting renderer written in C++ with Vulkan Compute for real-time viewing on any GPU vendor",
  "long_description": "3DGS.cpp is a C++ implementation of 3D Gaussian Splatting rendering that uses Vulkan Compute shaders for the splatting pipeline, making it one of the only 3DGS viewers capable of running on non-NVIDIA hardware. While the vast majority of Gaussian Splatting tools require CUDA and are limited to NVIDIA GPUs, 3DGS.cpp leverages the cross-platform Vulkan API to support NVIDIA, AMD, Intel, and Apple Silicon GPUs (via MoltenVK on macOS).\n\nDesigned primarily as a real-time viewer for pre-trained Gaussian Splatting models, 3DGS.cpp loads standard PLY files exported by the original INRIA implementation, gsplat, Nerfstudio, and other training frameworks. The Vulkan Compute-based sorting and rendering pipeline delivers performance competitive with CUDA-based viewers on equivalent hardware. The implementation focuses on rendering quality and interactivity rather than training — it does not include 3DGS optimization or training capabilities.\n\n3DGS.cpp fills a critical gap in the Gaussian Splatting ecosystem. The CUDA requirement of most 3DGS tools has been a significant barrier for researchers and developers with AMD or Apple hardware. By providing a portable, high-performance viewer with a clean C++ codebase and MIT license, 3DGS.cpp enables broader adoption of Gaussian Splatting technology and serves as a foundation for integrating 3DGS viewing into custom applications and products that need cross-platform GPU support.",
  "technique": ["gaussian_splatting", "neural"],
  "language": "C++/Vulkan",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["vulkan"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["ply"],
  "output_formats": ["png"],
  "homepage": "https://github.com/shg8/3DGS.cpp",
  "repository": "https://github.com/shg8/3DGS.cpp",
  "first_release": "2023-10-01",
  "latest_release": "2024-03-01",
  "latest_release_version": "0.1.0",
  "status": "active",
  "github_stars": 1000,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 10,
  "open_issues": 20,
  "fork_count": 70,
  "tags": [
    "gaussian-splatting",
    "vulkan",
    "cross-platform",
    "real-time",
    "viewer",
    "3dgs",
    "cpp",
    "gpu"
  ],
  "strengths": [
    "Cross-platform GPU support via Vulkan — runs on NVIDIA, AMD, Intel, and Apple Silicon GPUs, making it the most hardware-portable 3DGS viewer available",
    "Pure C++ implementation without Python or CUDA dependency makes deployment simpler and the binary smaller than PyTorch-based alternatives",
    "Real-time rendering performance competitive with CUDA-based viewers on equivalent hardware",
    "Can load standard PLY files from any 3DGS training framework (INRIA, gsplat, Nerfstudio), serving as a universal viewer for the Gaussian Splatting ecosystem",
    "MIT license and clean C++ codebase make it suitable for integration into custom applications and commercial products"
  ],
  "limitations": [
    "Viewer only — does not include 3DGS training, so users must train models with separate CUDA-based tools before viewing",
    "Vulkan dependency requires relatively modern GPU drivers and does not work on older hardware without Vulkan support",
    "Smaller community and less documentation than the original INRIA implementation or Nerfstudio",
    "May not support all variants and extensions of 3DGS (anti-aliased 3DGS, 2DGS, etc.) that specialized training frameworks produce",
    "No built-in video or batch image export pipeline — primarily designed for interactive viewing sessions"
  ],
  "best_for": "Viewing pre-trained Gaussian Splatting models on non-NVIDIA hardware, deploying 3DGS viewers in cross-platform applications, and developers needing a C++/Vulkan-based 3DGS rendering library",
  "not_ideal_for": "Training Gaussian Splatting models, NeRF workflows, tasks requiring Python or PyTorch integration, or rendering on hardware without Vulkan support",
  "related": ["3d-gaussian-splatting", "gsplat", "gaussian-splatting-lightning", "nerfstudio"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": null,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "git clone https://github.com/shg8/3DGS.cpp && cd 3DGS.cpp && cmake -B build && cmake --build build",
  "community_links": {},
  "citations": [],
  "tutorials": [
    {
      "title": "3DGS.cpp README and Usage Guide",
      "url": "https://github.com/shg8/3DGS.cpp",
      "type": "article"
    }
  ]
}