{
  "id": "appleseed",
  "name": "appleseed",
  "version": "2.1.0-beta",
  "description": "Production-quality physically based renderer with Disney material model and multi-DCC integration",
  "long_description": "appleseed is an open-source, physically based global illumination rendering engine designed for animation and visual effects production. Originally developed by François Beaune starting around 2010, it grew into a community-maintained project with a focus on providing a permissively licensed (MIT) alternative to commercial production renderers. The project targets the gap between research renderers (like PBRT) and artist-oriented tools (like Cycles), offering production features with a clean, well-documented C++ codebase.\n\nThe renderer implements the Disney Principled BSDF material model, supports Open Shading Language (OSL) for programmable shading, and provides physically accurate global illumination through unidirectional path tracing. It handles volumetric rendering, subsurface scattering, motion blur, depth of field, and procedural geometry instancing. A built-in BCD denoiser and support for post-process denoisers complete the production pipeline. appleseed is CPU-only, with no GPU rendering path.\n\nA distinguishing feature of appleseed is its multi-DCC integration strategy — it provides plugins for Autodesk Maya (mayaseed), Autodesk 3ds Max (appleseedmax), and Blender (blenderseed), making it one of the few open-source renderers bridging the Maya/3ds Max ecosystem. However, development has slowed significantly since the 2.1.0-beta release in 2021, with infrequent commits suggesting the project is in maintenance mode rather than active feature development.",
  "technique": ["path_tracing"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["appleseed", "obj"],
  "output_formats": ["exr", "png", "jpg", "tiff"],
  "homepage": "https://appleseedhq.net",
  "repository": "https://github.com/appleseedhq/appleseed",
  "documentation": "https://appleseedhq.net/docs.html",
  "first_release": "2010-01-01",
  "latest_release": "2021-06-01",
  "latest_release_version": "2.1.0-beta",
  "status": "maintenance",
  "github_stars": 2200,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 80,
  "open_issues": 280,
  "fork_count": 330,
  "tags": [
    "production",
    "physically-based",
    "vfx",
    "animation",
    "osl",
    "maya",
    "disney-bsdf",
    "permissive-license"
  ],
  "strengths": [
    "MIT license is one of the most permissive available — enables unrestricted use in commercial products, proprietary pipelines, and derivative works without copyleft obligations",
    "Implements the Disney Principled BSDF material model and supports Open Shading Language (OSL), aligning with industry standards used by Pixar's RenderMan, Arnold, and Cycles",
    "Multi-DCC integration with plugins for Blender, Maya, and 3ds Max makes it one of the few open-source renderers that bridges the Autodesk ecosystem alongside Blender",
    "Clean, well-structured C++ codebase with comprehensive documentation makes it suitable for study and as a foundation for custom production rendering pipelines",
    "Built-in BCD denoiser provides noise reduction without requiring external tools, which is essential for production workflows with limited render time budgets"
  ],
  "limitations": [
    "CPU-only architecture means render times for complex production scenes are significantly longer than GPU-accelerated alternatives like Cycles or LuxCoreRender, with no announced GPU roadmap",
    "Development has slowed substantially since the 2.1.0-beta release in 2021 — infrequent commits and no new major releases suggest the project may not keep pace with evolving industry standards",
    "DCC plugins may not support the latest versions of Blender, Maya, or 3ds Max, as plugin maintenance depends on community volunteers with access to those tools",
    "Smaller community than Cycles or LuxCoreRender results in fewer tutorials, example scenes, material presets, and online resources for troubleshooting",
    "No spectral rendering, differentiable rendering, or GPU acceleration limits its applicability for cutting-edge research use cases"
  ],
  "best_for": "Production pipelines needing a permissively licensed physically based renderer with Maya and 3ds Max integration, and developers studying a well-structured C++ rendering codebase",
  "not_ideal_for": "GPU-accelerated rendering workflows, real-time applications, or projects requiring active development with frequent releases and new features",
  "related": ["pbrt", "mitsuba3", "blender-cycles", "luxcorerender"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": true,
    "denoiser_builtin": true,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": true,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": true,
    "open_shading_language": true,
    "materialx": false
  },
  "integrations": ["Blender", "Maya", "3ds Max"],
  "install_command": "Download from https://appleseedhq.net/download.html",
  "community_links": {
    "discord": "https://discord.gg/Vcu5R7U",
    "forum": "https://forum.appleseedhq.net/"
  },
  "citations": [],
  "tutorials": [
    {
      "title": "appleseed Documentation",
      "url": "https://appleseedhq.net/docs.html",
      "type": "article"
    }
  ]
}
