{
  "id": "bevy",
  "name": "Bevy",
  "version": "0.15",
  "description": "Data-driven game engine built in Rust with an ECS architecture, modern rendering pipeline, and modular plugin system",
  "long_description": "Bevy is an open source game engine written in Rust that uses an Entity Component System (ECS) architecture as its foundational design pattern. Created by Cart (Carter Anderson) in 2020, Bevy treats every engine subsystem — rendering, audio, input, UI, physics — as a composable plugin that can be added, removed, or replaced independently. This modularity, combined with Rust's ownership model for memory safety and fearless concurrency, makes Bevy uniquely positioned among modern game engines.\n\nBevy's rendering pipeline is built on wgpu, a safe and portable graphics abstraction layer that maps to Vulkan, Metal, DirectX 12, and WebGPU. The renderer supports PBR materials with metallic/roughness workflows, cascaded shadow maps, screen-space ambient occlusion, bloom, tone mapping, volumetric fog, irradiance volumes for diffuse global illumination, and environment map reflections. Bevy uses a render graph architecture where rendering passes are defined as nodes in a directed acyclic graph, enabling flexible composition of rendering techniques.\n\nAs a pre-1.0 engine, Bevy is evolving rapidly with breaking API changes between releases. It does not yet have an official visual scene editor — all scene setup is done through Rust code — though community-built editor projects are emerging. Despite its youth, Bevy has attracted one of the fastest-growing communities in the Rust ecosystem, with thousands of contributors and a rich plugin ecosystem. Its compile-time safety guarantees, parallel ECS scheduling, and zero-cost abstractions appeal to developers who value performance and correctness, even at the cost of Rust's steeper learning curve.",
  "technique": ["rasterization"],
  "language": "Rust",
  "license": "MIT/Apache-2.0",
  "platforms": ["linux", "macos", "windows", "web", "android", "ios"],
  "gpu_support": true,
  "gpu_apis": ["vulkan", "metal", "directx", "webgpu"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["gltf", "glb"],
  "output_formats": ["framebuffer", "png"],
  "homepage": "https://bevyengine.org",
  "repository": "https://github.com/bevyengine/bevy",
  "documentation": "https://bevyengine.org/learn/",
  "first_release": "2020-08-10",
  "status": "active",
  "tags": [
    "real-time",
    "rust",
    "ecs",
    "game-engine",
    "wgpu",
    "data-driven",
    "cross-platform",
    "pbr",
    "open-source",
    "modular",
    "vulkan",
    "webgpu"
  ],
  "strengths": [
    "Modern ECS architecture enables highly composable, parallel-friendly game logic with automatic scheduling of systems across available CPU cores",
    "Built on wgpu — a safe, portable graphics abstraction over Vulkan, Metal, DirectX 12, and WebGPU — providing broad GPU backend coverage from a single codebase",
    "Rust's ownership model provides compile-time memory safety guarantees and fearless concurrency without garbage collection overhead or runtime checks",
    "Extremely modular plugin architecture — the renderer, audio, UI, and every subsystem is an optional plugin that can be replaced or omitted entirely",
    "One of the fastest-growing open source game engines with a passionate contributor community, extensive documentation, and a rich third-party plugin ecosystem"
  ],
  "limitations": [
    "Pre-1.0 with frequent breaking API changes between releases — not yet suitable for long-term production projects requiring API stability",
    "No official visual scene editor — all scene setup, entity creation, and component configuration is done through Rust code",
    "Rendering feature set is still maturing — lacks advanced features like terrain systems, mature LOD pipelines, and sophisticated lightmapping found in established engines",
    "Rust's steep learning curve and longer compile times compared to GDScript, C#, or JavaScript can be a significant barrier for teams new to the language",
    "Ecosystem of third-party assets, importers, and pre-built game templates is small compared to Godot, Unity, or Unreal"
  ],
  "best_for": "Rust developers building games, simulations, or interactive applications who want a modern ECS architecture with memory safety, parallelism, and a modular plugin system",
  "not_ideal_for": "Teams needing a stable production engine with a visual editor, extensive asset marketplace, or rapid prototyping with a scripting language",
  "related": ["godot", "filament", "wicked-engine", "panda3d"],
  "features": {
    "global_illumination": true,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": false,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": true,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": true,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "cargo add bevy",
  "community_links": {
    "discord": "https://discord.gg/bevy",
    "forum": "https://github.com/bevyengine/bevy/discussions"
  },
  "tutorials": [
    {
      "title": "Bevy Book - Getting Started",
      "url": "https://bevyengine.org/learn/quick-start/getting-started/",
      "type": "article"
    },
    {
      "title": "Bevy Examples",
      "url": "https://bevyengine.org/examples/",
      "type": "article"
    }
  ]
}
