{
  "id": "bgfx",
  "name": "bgfx",
  "version": "2024.11",
  "description": "Cross-platform rendering abstraction supporting 12+ graphics APIs from a single codebase",
  "long_description": "bgfx is a cross-platform, graphics API-agnostic rendering library created and maintained by Branimir Karadžić. It provides a thin abstraction layer over a remarkable breadth of GPU backends: Direct3D 9, Direct3D 11, Direct3D 12, Metal, OpenGL 2.1+, OpenGL ES 2+, Vulkan, WebGL 1/2, WebGPU, and console-specific APIs including GNM (PS4), AGC (PS5), and NVN (Nintendo Switch). No other open-source rendering library matches this backend coverage from a single, unified C99 API.\n\nbgfx's philosophy is deliberately minimalist: it handles GPU command submission, state management, resource creation, and shader compilation, but provides no scene graph, no material system, no asset pipeline, and no physics. This 'bring your own engine' approach makes bgfx ideal for developers building custom rendering stacks who need a portable GPU abstraction without opinionated higher-level systems. The library ships with shaderc, a cross-platform shader compiler that translates a GLSL-like shading language into backend-specific formats.\n\nThe project includes over 40 example programs demonstrating techniques ranging from basic triangle rendering to deferred shading, physically based rendering, order-independent transparency, and GPU-driven rendering. These examples serve as the primary learning resource, as bgfx has no formal documentation beyond well-commented C99 headers. bgfx is used in production by game studios, visualization tools, and development environments including the LÖVE 2D framework and various indie titles.",
  "technique": ["rasterization"],
  "language": "C/C++",
  "license": "BSD-2-Clause",
  "platforms": ["linux", "macos", "windows", "ios", "android", "web"],
  "gpu_support": true,
  "gpu_apis": ["vulkan", "metal", "directx", "webgl", "webgpu"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["custom"],
  "output_formats": ["framebuffer", "png"],
  "homepage": "https://bkaradzic.github.io/bgfx/",
  "repository": "https://github.com/bkaradzic/bgfx",
  "documentation": "https://bkaradzic.github.io/bgfx/",
  "first_release": "2012-06-01",
  "latest_release": "2024-11-01",
  "status": "active",
  "tags": [
    "rendering-abstraction",
    "cross-platform",
    "vulkan",
    "metal",
    "directx",
    "opengl",
    "webgpu",
    "minimal",
    "low-level",
    "real-time"
  ],
  "strengths": [
    "Unmatched backend coverage — a single C99 API compiles to 12+ graphics APIs including Vulkan, DirectX 9/11/12, Metal, OpenGL, WebGL, WebGPU, and console-specific backends (GNM, AGC, NVN)",
    "Extremely clean, minimal C99 API with zero unnecessary abstractions — the entire public API surface fits in a single well-commented header file",
    "Ships with shaderc, a powerful cross-platform shader compiler that translates one shader source into all supported backend formats",
    "Over 40 example programs demonstrate advanced rendering techniques from basics through PBR, deferred shading, and GPU-driven rendering, serving as a practical learning resource",
    "Battle-tested in production games and tools including the LÖVE framework and various indie titles, with a track record of stable backward compatibility"
  ],
  "limitations": [
    "Provides only a GPU submission layer — no scene graph, material system, asset pipeline, physics, audio, or any higher-level abstraction is included",
    "The custom shader cross-compilation system (shaderc) requires learning its own GLSL-like dialect and has limitations compared to writing raw HLSL or GLSL directly",
    "Primarily maintained by a single developer, which poses a bus-factor concern for teams considering it as a long-term production dependency",
    "No formal documentation beyond header comments and example code — learning bgfx requires studying the example programs and reading source",
    "Debugging can be challenging since GPU errors surface at the backend API level without a high-level diagnostic layer to translate them"
  ],
  "best_for": "Engine developers and tool creators who need a thin, portable GPU abstraction layer without opinionated scene management or material systems",
  "not_ideal_for": "Developers who want a ready-to-use rendering engine with built-in materials, scene management, or beginner-friendly documentation",
  "related": ["ogre3d", "the-forge", "sokol", "filament"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": false,
    "screen_space_effects": false,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 15200,
  "github_stars_trend": [14000, 14100, 14250, 14400, 14500, 14600, 14700, 14800, 14900, 15000, 15100, 15200],
  "commit_activity_52w": [5, 8, 3, 12, 7, 4, 9, 6, 11, 5, 3, 8, 7, 10, 4, 6, 9, 3, 5, 8, 11, 7, 4, 6, 9, 3, 8, 5, 10, 7, 4, 6, 12, 3, 5, 9, 8, 4, 7, 6, 3, 11, 5, 8, 4, 9, 7, 3, 6, 10, 5, 8],
  "contributor_count": 250,
  "open_issues": 320,
  "fork_count": 2100,
  "install_command": "git clone https://github.com/bkaradzic/bgfx && cd bgfx && make",
  "community_links": {
    "discord": "https://discord.gg/bgfx",
    "forum": "https://github.com/bkaradzic/bgfx/discussions"
  },
  "tutorials": [
    {
      "title": "bgfx Examples Overview",
      "url": "https://bkaradzic.github.io/bgfx/examples.html",
      "type": "article"
    },
    {
      "title": "bgfx API Reference",
      "url": "https://bkaradzic.github.io/bgfx/bgfx.html",
      "type": "article"
    }
  ]
}
