{
  "id": "blender-cycles",
  "name": "Blender Cycles",
  "version": "4.2.0",
  "description": "Production path tracer integrated into Blender with exceptionally broad GPU vendor support",
  "long_description": "Blender Cycles is the physically based production renderer built into Blender, the open-source 3D creation suite. Originally developed by Brecht Van Lommel starting in 2011, Cycles has grown into one of the most widely used open-source path tracers, powering professional animation, VFX, and architectural visualization workflows. It is deeply integrated with Blender's modeling, sculpting, texturing, and compositing tools, providing a complete end-to-end pipeline.\n\nCycles stands out for its exceptionally broad GPU support — it can render on NVIDIA GPUs (via CUDA and OptiX), AMD GPUs (via HIP), Intel Arc GPUs (via oneAPI), and Apple Silicon (via Metal), making it the most hardware-agnostic GPU path tracer in the open-source ecosystem. The renderer features the Principled BSDF (based on Disney's material model), node-based material authoring, built-in Intel Open Image Denoise integration, and support for OpenColorIO color management. It handles volumetric rendering, subsurface scattering, motion blur, depth of field, and hair/fur rendering.\n\nBacked by the Blender Foundation with corporate sponsorship from AMD, Apple, Intel, Meta, and NVIDIA, Cycles receives continuous investment and optimization. Its user community numbers in the millions, producing an unmatched wealth of tutorials, material libraries, and add-ons. While Cycles is primarily accessed through Blender, a standalone library version exists for embedding in other applications.",
  "technique": ["path_tracing"],
  "language": "C/C++",
  "license": "Apache-2.0",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda", "optix", "hip", "oneapi", "metal"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["blend", "obj", "gltf", "glb", "fbx", "collada", "stl", "ply", "usd", "abc"],
  "output_formats": ["exr", "png", "jpg", "tiff", "bmp", "hdr"],
  "homepage": "https://www.blender.org",
  "repository": "https://projects.blender.org/blender/blender",
  "documentation": "https://docs.blender.org/manual/en/latest/render/cycles/",
  "first_release": "2011-10-01",
  "latest_release": "2024-07-16",
  "latest_release_version": "4.2.0",
  "status": "active",
  "github_stars": 14000,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 600,
  "open_issues": 5500,
  "fork_count": 2000,
  "tags": [
    "production",
    "physically-based",
    "gpu",
    "blender",
    "artist-friendly",
    "denoising",
    "animation",
    "vfx"
  ],
  "strengths": [
    "Broadest GPU vendor support of any open-source path tracer — renders on NVIDIA (CUDA/OptiX), AMD (HIP), Intel Arc (oneAPI), and Apple Silicon (Metal), ensuring users are never locked to a single hardware vendor",
    "Deep integration with Blender's complete DCC pipeline means artists can model, texture, light, render, and composite without leaving one application",
    "Massive user community with millions of users produces an unmatched wealth of tutorials, material libraries, add-ons, and community support resources",
    "Built-in Intel Open Image Denoise integration enables production-quality noise reduction that dramatically shortens render times for final output",
    "Continuous investment from the Blender Foundation and corporate sponsors (AMD, Apple, Intel, NVIDIA, Meta) ensures long-term stability and ongoing performance improvements"
  ],
  "limitations": [
    "Tightly coupled to Blender — while a standalone library exists, headless or scriptable use outside of Blender requires running Blender in background mode via command line, which is heavier than lightweight CLI renderers",
    "No spectral rendering — all light transport is computed in RGB, which limits physical accuracy for specialized scientific applications that require wavelength-dependent simulation",
    "Node-based material system, while powerful, has a steeper learning curve for developers and researchers accustomed to programmatic material definition in code",
    "Does not support bidirectional path tracing or photon mapping, which can result in slower convergence for scenes with complex caustics compared to renderers like LuxCoreRender",
    "Render times for complex production scenes without GPU acceleration can be significantly longer than dedicated GPU-first renderers"
  ],
  "best_for": "Artists and studios wanting a complete production pipeline from modeling to final render with broad GPU hardware support and an active community",
  "not_ideal_for": "Headless research benchmarking workflows, spectral rendering research, or developers needing a lightweight embeddable rendering library",
  "related": ["pbrt", "mitsuba3", "luxcorerender", "appleseed"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": true,
    "instancing": true,
    "out_of_core": true,
    "adaptive_sampling": true,
    "denoiser_builtin": true,
    "gpu_rendering": true,
    "multi_gpu": true,
    "network_rendering": false,
    "hardware_ray_tracing": true,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": true,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": true,
    "open_shading_language": true,
    "materialx": false
  },
  "integrations": ["Blender"],
  "install_command": "Download from https://www.blender.org/download/ — Cycles is included with Blender",
  "community_links": {
    "discord": "https://discord.gg/blender",
    "forum": "https://devtalk.blender.org/",
    "stackoverflow_tag": "blender"
  },
  "citations": [
    {
      "title": "Blender 4.2 Release Notes",
      "url": "https://wiki.blender.org/wiki/Reference/Release_Notes/4.2",
      "year": 2024
    }
  ],
  "tutorials": [
    {
      "title": "Blender Cycles Rendering Manual",
      "url": "https://docs.blender.org/manual/en/latest/render/cycles/",
      "type": "article"
    },
    {
      "title": "Blender Guru - Beginner Tutorial Series",
      "url": "https://www.youtube.com/watch?v=nIoXOplUvAw",
      "type": "video"
    }
  ]
}
