{
  "id": "blender-eevee",
  "name": "Blender EEVEE",
  "version": "4.2.0",
  "description": "Blender's built-in real-time PBR viewport renderer using rasterization with physically based approximations",
  "long_description": "EEVEE (Extra Easy Virtual Environment Engine) is Blender's built-in real-time rendering engine, first introduced in Blender 2.80 in July 2019. Created by Clément Foucault as part of the Blender Foundation development team, EEVEE was designed as a fast-preview counterpart to Blender's offline path tracer, Cycles. Its defining characteristic is full compatibility with Blender's Principled BSDF material system — materials authored for physically accurate Cycles rendering automatically work in EEVEE with perceptually convincing rasterization-based approximations, enabling artists to switch between real-time preview and path-traced final output with a single click.\n\nEEVEE Next, a major architectural rewrite that landed in Blender 4.0 (November 2023), substantially advanced the renderer's capabilities. The rewrite introduced ray-traced reflections, refractions, and diffuse lighting (a screen-space and world-space hybrid, not full path tracing), virtual shadow maps for improved shadow quality, improved volumetric rendering, and reworked light probes with irradiance volumes and reflection cubemaps. The rendering pipeline is transitioning from OpenGL to Vulkan. Key features include screen-space reflections, screen-space ambient occlusion, volumetric lighting and fog, bloom, depth of field, motion blur, PBR materials, IBL via HDRI environments, and approximate subsurface scattering.\n\nEEVEE cannot be used outside of Blender — there is no standalone library, API, or executable. This tight integration is both its strength and its limitation: it provides seamless viewport rendering within Blender's comprehensive 3D creation suite, but it is completely inaccessible to developers building custom rendering pipelines, web applications, or non-Blender tools. EEVEE benefits from Blender's massive community of millions of users, extensive documentation, thousands of tutorials, and continuous development funded by the Blender Foundation and major studio sponsors. Its GPL-2.0-or-later license is inherited from Blender.",
  "technique": ["rasterization"],
  "language": "C/C++",
  "license": "GPL-2.0-or-later",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["vulkan"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["blend"],
  "output_formats": ["png", "exr", "jpg", "tiff", "hdr", "bmp"],
  "homepage": "https://www.blender.org",
  "repository": "https://projects.blender.org/blender/blender",
  "documentation": "https://docs.blender.org/manual/en/latest/render/eevee/index.html",
  "first_release": "2019-07-30",
  "latest_release": "2024-07-16",
  "latest_release_version": "4.2.0",
  "status": "active",
  "github_stars": 16000,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 1500,
  "open_issues": 5000,
  "fork_count": 2500,
  "tags": [
    "blender",
    "real-time",
    "viewport-renderer",
    "physically-based",
    "production",
    "rasterization"
  ],
  "strengths": [
    "Seamlessly integrated into Blender's viewport — artists can switch between EEVEE (real-time preview) and Cycles (final-quality path tracing) with a single click using identical materials, lights, and scene setup, making it the fastest iteration tool for Blender-based production pipelines",
    "EEVEE Next (Blender 4.0+) introduced ray-traced reflections, refractions, and diffuse lighting that bring visual quality dramatically closer to Cycles output while maintaining interactive frame rates, significantly narrowing the traditional quality gap between rasterized previews and path-traced finals",
    "Full PBR material support via Blender's Principled BSDF node means materials authored for physically accurate Cycles rendering automatically work in EEVEE with perceptually convincing approximations, eliminating the need to maintain separate material setups for preview and final output",
    "Volumetric lighting, screen-space effects (SSAO, SSR, bloom, DoF, motion blur), and light-probe-based global illumination approximations produce visually rich output suitable for motion graphics, product visualization previews, and animation at interactive rates",
    "Part of the Blender ecosystem with millions of users, thousands of tutorials, and continuous development funded by the Blender Foundation and major studio sponsors including NVIDIA, AMD, Apple, Meta, and Epic Games"
  ],
  "limitations": [
    "Cannot be used outside of Blender — there is no standalone library, API, or executable, meaning EEVEE is inaccessible to developers building custom rendering pipelines, web applications, or non-Blender tools",
    "Global illumination is approximated via light probes and screen-space techniques rather than physically accurate computation — scenes with complex indirect lighting, caustics, or multi-bounce color bleeding will show visible differences compared to Cycles path-traced output",
    "GPL-2.0-or-later license inherited from Blender means any derivative work must also be GPL, which restricts integration into proprietary software and limits applicability in commercial pipelines that require permissive licensing",
    "Requires a modern GPU with OpenGL 4.3+ (EEVEE Legacy) or Vulkan (EEVEE Next) — cannot run on CPU-only systems or older hardware, and rendering quality can vary across GPU vendors and driver versions",
    "Scene complexity is limited by GPU memory and real-time performance constraints — extremely dense scenes with millions of polygons, many lights, or large volumetric effects can drop below interactive frame rates or exceed VRAM limits"
  ],
  "best_for": "Blender artists and animators who need fast, interactive preview rendering with Cycles-compatible materials for scene iteration, motion graphics, architectural visualization previews, and animation lookdev",
  "not_ideal_for": "Standalone or embedded rendering use cases outside Blender, physically accurate final-quality rendering (use Cycles instead), projects requiring permissive licensing, or custom rendering pipelines",
  "related": ["blender-cycles", "filament", "godot", "luxcorerender"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": null,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": false,
    "animation_support": true,
    "python_api": true,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": true,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender"],
  "install_command": "Download from https://www.blender.org/download/ — EEVEE is included with Blender",
  "community_links": {
    "forum": "https://devtalk.blender.org/",
    "mailing_list": "https://lists.blender.org/",
    "stackoverflow_tag": "blender"
  },
  "citations": [],
  "tutorials": [
    {
      "title": "Blender Manual — EEVEE Renderer",
      "url": "https://docs.blender.org/manual/en/latest/render/eevee/index.html",
      "type": "article"
    }
  ]
}
