{
  "id": "deodr",
  "name": "DEODR",
  "version": "0.1.17",
  "description": "C-based differentiable mesh renderer with both PyTorch and TensorFlow interfaces for 3D-from-2D optimization",
  "long_description": "DEODR (Differentiable Estimator of Optical properties through Differentiable Rendering) is a unique differentiable mesh renderer whose core is implemented in C rather than CUDA. Developed by Martin de La Gorce, it stands apart from every other differentiable renderer in the ecosystem by running entirely on CPU, making it the only option that works on machines without NVIDIA GPUs — including Apple Silicon Macs, CI servers without GPUs, and lightweight laptops.\n\nThe renderer supports triangle mesh rasterization with vertex colors and texture mapping, computing derivatives with respect to vertex positions, colors, texture, camera parameters, and lighting parameters. Its edge-based approach to handling occlusion boundaries differs from SoftRasterizer's probabilistic assignment and nvdiffrast's hardware-accelerated approach, offering a third perspective on the problem of differentiable visibility. DEODR's most distinctive feature beyond CPU portability is its dual-framework support: the C core is wrapped for both PyTorch and TensorFlow, plus a pure NumPy/SciPy mode for environments without deep learning frameworks. This three-way interface is unmatched by any other differentiable renderer.\n\nThe trade-off is performance — CPU rendering is significantly slower than GPU-based alternatives for large scenes — but for moderate-scale problems (meshes with fewer than 100K faces at moderate resolution), the hardware accessibility and framework flexibility are genuine advantages. DEODR is installable via pip with no CUDA compilation step, eliminating the setup friction that plagues most differentiable rendering tools. The BSD-2-Clause license is maximally permissive, and the C core enables potential embedding in non-Python environments.",
  "technique": ["differentiable", "rasterization"],
  "language": "C/Python",
  "license": "BSD-2-Clause",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["obj", "programmatic"],
  "output_formats": ["png"],
  "homepage": "https://github.com/martinResearch/DEODR",
  "repository": "https://github.com/martinResearch/DEODR",
  "paper": "https://arxiv.org/abs/2011.06988",
  "paper_bibtex": "@misc{delagorce2020deodr,\n  title={DEODR: Differentiable Renderer and 3D Scene Optimization},\n  author={de La Gorce, Martin},\n  year={2020},\n  eprint={2011.06988},\n  archivePrefix={arXiv}\n}",
  "first_release": "2020-01-15",
  "latest_release": "2023-06-01",
  "latest_release_version": "0.1.17",
  "status": "maintenance",
  "github_stars": 200,
  "github_stars_trend": [140, 148, 155, 162, 168, 174, 179, 184, 188, 192, 196, 200],
  "commit_activity_52w": [0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0],
  "contributor_count": 3,
  "open_issues": 12,
  "fork_count": 30,
  "tags": [
    "differentiable-rendering",
    "cpu-rendering",
    "pytorch",
    "tensorflow",
    "numpy",
    "mesh-rendering",
    "3d-reconstruction",
    "c-implementation",
    "cross-platform"
  ],
  "strengths": [
    "Only differentiable mesh renderer in the ecosystem that runs entirely on CPU — no CUDA or GPU required, making it accessible on Apple Silicon Macs, CI servers, and any hardware where NVIDIA GPUs are unavailable",
    "Unique dual-framework support: the C core is wrapped for both PyTorch and TensorFlow, plus a pure NumPy/SciPy mode, allowing researchers to use their framework of choice without changing the rendering backend",
    "Clean pip installation with no CUDA compilation step — eliminates the setup friction that plagues most differentiable rendering tools, where CUDA toolkit version mismatches are a common source of hours-long debugging",
    "BSD-2-Clause license is maximally permissive, and the C core enables potential embedding in non-Python environments or lightweight edge deployment"
  ],
  "limitations": [
    "CPU-only rendering is orders of magnitude slower than GPU-based alternatives for high-resolution images or meshes exceeding tens of thousands of faces — not viable for large-scale training loops common in modern differentiable rendering research",
    "Minimal shading model limited to Lambertian reflectance with directional lighting — no PBR materials, environment maps, or global illumination effects",
    "Very small community with limited documentation, few tutorials, and no dedicated support channels — users must rely on the repository README and source code",
    "Feature set is sparse compared to PyTorch3D or nvdiffrast — no support for point clouds, volumetric data, advanced material models, or multi-view rendering utilities",
    "Edge-based occlusion handling may produce different gradient characteristics than soft rasterization or nvdiffrast's approach, which can affect optimization convergence in some scenarios"
  ],
  "best_for": "CPU-based differentiable mesh rendering and 3D-from-2D optimization on machines without CUDA-capable GPUs, or when dual PyTorch/TensorFlow support is needed",
  "not_ideal_for": "High-resolution or large-scale differentiable rendering where GPU acceleration is available — use PyTorch3D or nvdiffrast for production GPU workflows",
  "related": ["pytorch3d", "softrasterizer", "nvdiffrast", "tensorflow-graphics"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": true,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["PyTorch", "TensorFlow", "NumPy"],
  "install_command": "pip install deodr",
  "citations": [
    {
      "title": "DEODR: Differentiable Renderer and 3D Scene Optimization",
      "url": "https://arxiv.org/abs/2011.06988",
      "year": 2020
    }
  ],
  "tutorials": []
}