{
  "id": "drjit",
  "name": "Dr.Jit",
  "version": "1.0.0",
  "description": "Just-in-time compiler for vectorized and differentiable computation — the computational backbone of Mitsuba 3",
  "long_description": "Dr.Jit is a just-in-time (JIT) compiler for vectorized and differentiable numerical computation, developed at EPFL by Wenzel Jakob and collaborators. It is not a renderer — it is the computational infrastructure layer that powers Mitsuba 3's differentiable rendering capabilities. Dr.Jit transforms Python or C++ numerical programs into optimized machine code targeting multiple backends: scalar (for debugging), LLVM (for vectorized CPU execution), and CUDA (for GPU execution), all from a single source without code changes.\n\nThe system's core contribution is enabling efficient automatic differentiation of arbitrary numerical programs, not just predefined rendering operations. Where PyTorch's autograd is limited to its own tensor operations and computational graph, Dr.Jit can differentiate custom algorithms — including physically based rendering integrators, custom BSDF evaluation, Monte Carlo sampling strategies, and physics simulations — at compiled-code performance levels. It supports both forward-mode and reverse-mode differentiation, with lazy evaluation and kernel fusion for memory-efficient computation.\n\nDr.Jit provides a NumPy-like array programming interface in Python, making it familiar to scientific computing users. Its arrays track computational graphs across operations and compile them into fused kernels on demand. While its primary use case is as the engine behind Mitsuba 3, Dr.Jit is a standalone library that can be used for any differentiable computation task — optimization, physics simulation, inverse problems, or custom rendering algorithms. The system requires a conceptual understanding of JIT tracing, lazy evaluation, and kernel compilation that sets it apart from eager-execution frameworks.",
  "technique": ["differentiable"],
  "language": "C++/Python",
  "license": "BSD-3-Clause",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["programmatic"],
  "output_formats": ["tensor"],
  "homepage": "https://drjit.readthedocs.io/en/latest/",
  "repository": "https://github.com/mitsuba-renderer/drjit",
  "documentation": "https://drjit.readthedocs.io/en/latest/",
  "paper": "https://doi.org/10.1145/3528223.3530099",
  "paper_bibtex": "@article{jakob2022drjit,\n  title={Dr.Jit: A Just-In-Time Compiler for Differentiable Rendering},\n  author={Jakob, Wenzel and Speierer, S{\\'e}bastien and Roussel, Nicolas and Vicini, Delio},\n  journal={ACM Transactions on Graphics},\n  volume={41},\n  number={4},\n  pages={1--19},\n  year={2022},\n  publisher={ACM}\n}",
  "first_release": "2022-01-01",
  "latest_release": "2024-09-27",
  "latest_release_version": "1.0.0",
  "status": "active",
  "github_stars": 600,
  "github_stars_trend": [350, 380, 400, 430, 450, 470, 490, 510, 530, 555, 580, 600],
  "commit_activity_52w": [8, 12, 5, 7, 10, 6, 3, 9, 14, 8, 5, 7, 11, 6, 4, 8, 12, 9, 5, 3, 7, 10, 8, 6, 4, 9, 13, 7, 5, 8, 11, 6, 3, 7, 10, 8, 5, 4, 9, 12, 7, 6, 3, 8, 10, 5, 7, 9, 6, 4, 8, 11],
  "contributor_count": 25,
  "open_issues": 40,
  "fork_count": 55,
  "tags": [
    "differentiable",
    "jit-compiler",
    "automatic-differentiation",
    "cuda",
    "llvm",
    "vectorized",
    "mitsuba3",
    "numerical-computing",
    "python",
    "cpp"
  ],
  "strengths": [
    "JIT compilation transforms Python numerical code into optimized CUDA or LLVM kernels automatically, achieving compiled-code performance from Python-level programs without manual kernel writing or framework-specific tensor operations",
    "Supports forward and reverse-mode automatic differentiation of arbitrary programs — not limited to predefined rendering operations, enabling differentiation of custom integrators, BSDFs, sampling strategies, and physics simulations",
    "Multiple backend targets from a single codebase: scalar (debugging with readable outputs), LLVM (vectorized CPU with SIMD), and CUDA (GPU), selectable at runtime without any source code modifications",
    "The proven computational engine behind Mitsuba 3, demonstrated at scale for differentiable rendering of complex physically based scenes with spectral light transport, volumetric effects, and gradient-based optimization",
    "Clean NumPy-like array programming interface that feels natural to Python scientific computing users, with lazy evaluation and kernel fusion for memory-efficient computation of large computational graphs"
  ],
  "limitations": [
    "Not a renderer — Dr.Jit produces no images on its own. Users who want to render must build a complete rendering pipeline on top of Dr.Jit or use Mitsuba 3, which does this work for them",
    "Incompatible with PyTorch's autograd ecosystem — programs must use Dr.Jit arrays throughout, not PyTorch tensors, and bridging between the two requires explicit conversion with performance overhead and loss of gradient tracking",
    "Steep learning curve due to JIT tracing semantics — understanding lazy evaluation, kernel compilation boundaries, and Dr.Jit's memory model requires significant investment, especially for users coming from eager-execution frameworks like PyTorch",
    "Smaller community and ecosystem than PyTorch — fewer tutorials, Stack Overflow answers, and community examples. Most practical usage is through Mitsuba 3 rather than direct Dr.Jit programming"
  ],
  "best_for": "Researchers building custom differentiable rendering, physics simulation, or optimization algorithms who need compiled-code performance from Python — particularly those already using or planning to use Mitsuba 3",
  "not_ideal_for": "Users who want a ready-to-use differentiable renderer — Dr.Jit is computational infrastructure, not an application. Use Mitsuba 3 (built on Dr.Jit) or PyTorch3D for a higher-level rendering experience",
  "related": ["mitsuba3", "redner", "pytorch3d", "nvdiffrast", "nvidia-kaolin"],
  "features": {
    "global_illumination": null,
    "path_tracing": null,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": null,
    "subsurface_scattering": null,
    "motion_blur": null,
    "depth_of_field": null,
    "spectral_rendering": null,
    "polarization": null,
    "caustics": null,
    "instancing": null,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": null,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": null,
    "hdri_environment": null,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": null,
    "animation_support": null,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Mitsuba 3"],
  "install_command": "pip install drjit",
  "community_links": {
    "forum": "https://github.com/mitsuba-renderer/drjit/discussions"
  },
  "citations": [
    {
      "title": "Dr.Jit: A Just-In-Time Compiler for Differentiable Rendering",
      "url": "https://doi.org/10.1145/3528223.3530099",
      "year": 2022
    }
  ],
  "tutorials": [
    {
      "title": "Dr.Jit Documentation",
      "url": "https://drjit.readthedocs.io/en/latest/",
      "type": "article"
    },
    {
      "title": "Dr.Jit Getting Started Guide",
      "url": "https://drjit.readthedocs.io/en/latest/basics.html",
      "type": "article"
    }
  ]
}