{
  "id": "embree",
  "name": "Intel Embree",
  "version": "4.3.3",
  "description": "High-performance ray tracing kernel library providing optimized BVH construction and ray traversal primitives",
  "long_description": "Intel Embree is an open source collection of high-performance ray tracing kernels developed by Intel as part of the oneAPI Rendering Toolkit. Unlike every other entry in the RenderScope catalog, Embree is not a renderer — it is a ray tracing kernel library that provides the fastest available CPU-based BVH (Bounding Volume Hierarchy) construction and ray-scene intersection queries. Applications built on Embree handle all shading, lighting, materials, and image output themselves; Embree provides only the geometric intersection infrastructure.\n\nEmbree's performance comes from hand-tuned ISPC (Intel SPMD Program Compiler) kernels and direct SSE, AVX, and AVX-512 vectorization. It supports single-ray, ray packet (4/8/16 wide), and ray stream tracing modes that enable efficient SIMD utilization across Intel architectures. Beyond triangles, Embree handles intersection with quads, curves and hair primitives, subdivision surfaces, points and spheres, user-defined geometries, and more. It natively supports geometry instancing and BVH-level motion blur with linear and quaternion interpolation — capabilities that higher-level renderers inherit transparently.\n\nThe impact of Embree on the rendering ecosystem is difficult to overstate. It is used as the ray tracing acceleration backend by PBRT v4, Mitsuba 3, Blender Cycles, LuxCoreRender, appleseed, Intel OSPRay, and numerous commercial renderers including Arnold, V-Ray, Corona Renderer, and KeyShot. This makes Embree arguably the single most impactful open source project in the ray tracing ecosystem — virtually every serious CPU-based renderer either uses Embree directly or competes against it. Embree 4 introduced experimental GPU support via SYCL for Intel Arc GPUs, though the CPU path remains the primary and most mature interface.",
  "technique": ["ray_tracing"],
  "language": "C++",
  "license": "Apache-2.0",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["obj"],
  "output_formats": ["ppm"],
  "homepage": "https://www.embree.org",
  "repository": "https://github.com/RenderKit/embree",
  "documentation": "https://www.embree.org/api.html",
  "paper": "https://doi.org/10.1145/2601097.2601199",
  "paper_bibtex": "@article{wald2014embree,\n  title={Embree: A Kernel Framework for Efficient {CPU} Ray Tracing},\n  author={Wald, Ingo and Woop, Sven and Benthin, Carsten and Johnson, Gregory S. and Ernst, Manfred},\n  journal={ACM Transactions on Graphics (Proceedings of SIGGRAPH)},\n  volume={33},\n  number={4},\n  pages={143:1--143:8},\n  year={2014},\n  publisher={ACM},\n  doi={10.1145/2601097.2601199}\n}",
  "first_release": "2011-01-01",
  "latest_release": "2024-10-01",
  "latest_release_version": "4.3.3",
  "status": "active",
  "github_stars": 2800,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 50,
  "open_issues": 40,
  "fork_count": 380,
  "tags": [
    "ray-tracing",
    "bvh",
    "intersection",
    "kernel-library",
    "ispc",
    "simd",
    "intel",
    "cpu",
    "acceleration-structure",
    "infrastructure"
  ],
  "strengths": [
    "Fastest available CPU ray tracing intersection library — hand-tuned ISPC and SSE/AVX/AVX-512 kernels deliver unmatched BVH traversal and intersection performance",
    "Used as the acceleration backbone by the majority of serious open source and commercial renderers (PBRT, Mitsuba, Cycles, LuxCore, Arnold, V-Ray, Corona, KeyShot), making it the most influential single project in the ray tracing ecosystem",
    "Supports a wide variety of geometry primitives beyond triangles — curves and hair, subdivision surfaces, points and spheres, quads, and user-defined geometries with custom intersection logic",
    "BVH-level motion blur support with linear and quaternion interpolation is a rare capability for an intersection library, enabling transparent motion blur in all renderers that use Embree",
    "Clean C API with comprehensive documentation makes integration into new rendering applications straightforward"
  ],
  "limitations": [
    "Not a renderer — Embree computes ray-scene intersections only and does not shade, light, or produce images on its own, requiring a full renderer to be built or used on top of it",
    "CPU performance is optimized for Intel architectures via ISPC targeting Intel ISA extensions — functional on AMD CPUs but may not achieve peak vectorized performance",
    "GPU support (Embree 4 via SYCL) is experimental and limited to Intel Arc GPUs — not a general-purpose GPU ray tracing solution like OptiX or DXR",
    "API is low-level and intersection-focused — users expecting a turnkey rendering solution will find Embree requires substantial application-level code for scene loading, shading, and output",
    "Documentation focuses on API reference rather than usage patterns or architectural guidance, making initial integration challenging for developers new to ray tracing"
  ],
  "best_for": "Developers building or optimizing ray tracing applications who need the fastest possible CPU ray-scene intersection queries as a foundation for their renderer",
  "not_ideal_for": "End users wanting to render images directly, artists needing a visual workflow, or anyone looking for a complete rendering solution rather than a building block",
  "related": ["ospray", "pbrt", "mitsuba3", "blender-cycles", "luxcorerender"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": true,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Intel OSPRay", "PBRT v4", "Mitsuba 3", "Blender Cycles", "LuxCoreRender", "appleseed", "Arnold", "V-Ray", "Corona Renderer"],
  "install_command": "Download from https://github.com/RenderKit/embree/releases or build from source with CMake",
  "community_links": {
    "forum": "https://github.com/RenderKit/embree/issues",
    "stackoverflow_tag": "embree"
  },
  "citations": [
    {
      "title": "Embree: A Kernel Framework for Efficient CPU Ray Tracing",
      "url": "https://doi.org/10.1145/2601097.2601199",
      "year": 2014
    }
  ],
  "tutorials": [
    {
      "title": "Embree API Documentation",
      "url": "https://www.embree.org/api.html",
      "type": "article"
    },
    {
      "title": "Embree Tutorials and Examples",
      "url": "https://github.com/RenderKit/embree#tutorials",
      "type": "article"
    }
  ]
}