{
  "id": "godot",
  "name": "Godot Engine",
  "version": "4.4",
  "description": "Open source game engine with Vulkan and OpenGL renderers, GDScript and C# scripting, and a full visual editor",
  "long_description": "Godot Engine is a fully integrated, community-driven open source game engine offering both 2D and 3D rendering capabilities. Since the release of Godot 4.0 in 2023, the engine features a modern Vulkan-based rendering backend (Forward+ and Mobile renderers) alongside an OpenGL-based Compatibility renderer for older hardware and web export. Godot is developed by a global community of contributors and funded through donations and grants, with no corporate parent company or revenue-sharing model.\n\nGodot 4.x introduced several advanced rendering features uncommon in open source engines: Signed Distance Field Global Illumination (SDFGI) for real-time indirect lighting without baking, VoxelGI for dynamic volumetric global illumination, volumetric fog and atmospheric effects, screen-space reflections, and a comprehensive post-processing pipeline. The engine supports PBR materials via a StandardMaterial3D with metallic/roughness workflows, and provides a visual shader editor alongside code-based shading.\n\nBeyond rendering, Godot is a complete game development environment with a node-based scene system, GDScript (a Python-like scripting language), C# support via .NET, GDExtension for native C/C++ plugins, a built-in physics engine, audio system, animation tools, and one-click export to desktop, mobile, and web platforms. Its MIT license with no royalties or usage restrictions has made it the leading fully open source alternative to proprietary engines like Unity and Unreal. Godot is one of the most starred projects on GitHub, reflecting its massive and rapidly growing community.",
  "technique": ["rasterization"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows", "android", "ios", "web"],
  "gpu_support": true,
  "gpu_apis": ["vulkan"],
  "cpu_support": true,
  "real_time": true,
  "scene_formats": ["gltf", "glb", "obj", "collada", "fbx", "tscn", "escn"],
  "output_formats": ["framebuffer", "png", "jpg", "webp", "exr"],
  "homepage": "https://godotengine.org",
  "repository": "https://github.com/godotengine/godot",
  "documentation": "https://docs.godotengine.org/en/stable/",
  "first_release": "2014-01-15",
  "status": "active",
  "tags": [
    "real-time",
    "game-engine",
    "gdscript",
    "csharp",
    "vulkan",
    "opengl",
    "cross-platform",
    "open-source",
    "2d",
    "3d",
    "editor",
    "pbr",
    "sdfgi"
  ],
  "strengths": [
    "Fully integrated game engine with a polished visual editor, node-based scene system, and multiple scripting options (GDScript, C#, GDExtension for C/C++)",
    "Advanced real-time global illumination via SDFGI and VoxelGI — rare for open source engines, enabling dynamic indirect lighting without offline baking",
    "Massive and rapidly growing community with extensive documentation, tutorials, asset library, and active forum and Discord channels",
    "Exports to all major platforms (desktop, mobile, web) from a single project with built-in export templates and one-click deployment",
    "Completely free with no royalties, revenue sharing, splash screens, or usage restrictions under the MIT license"
  ],
  "limitations": [
    "3D rendering pipeline is less mature than the 2D pipeline — visual fidelity trails Unreal Engine and Unity for AAA-quality scenes with complex lighting",
    "Vulkan renderer (Forward+ and Mobile) still being stabilized — some GPU compatibility issues and driver-specific bugs persist across vendors",
    "Large-scale open world scenes can hit performance bottlenecks due to the scene tree architecture and limited built-in streaming/LOD systems",
    "GDScript, while accessible and well-integrated, is not a mainstream language — teams with existing C++/C# codebases face a learning curve",
    "Not designed as an embeddable renderer — extracting just the rendering subsystem from the engine for use in other applications is impractical"
  ],
  "best_for": "Indie game development, interactive 3D applications, and educational game programming where a fully integrated open source engine with no licensing costs is preferred",
  "not_ideal_for": "AAA-quality cinematic rendering, large open world games requiring advanced streaming, or applications that need only an embeddable rendering library without engine overhead",
  "related": ["filament", "bevy", "blender-eevee", "panda3d", "wicked-engine", "ogre3d"],
  "features": {
    "global_illumination": true,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": true,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": true,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender (community exporter)", "Jolt Physics"],
  "install_command": "Download from https://godotengine.org/download or build from source: scons platform=linuxbsd",
  "community_links": {
    "discord": "https://discord.gg/4JBkykG",
    "forum": "https://forum.godotengine.org/",
    "stackoverflow_tag": "godot"
  },
  "tutorials": [
    {
      "title": "Godot Getting Started - Step by Step",
      "url": "https://docs.godotengine.org/en/stable/getting_started/step_by_step/index.html",
      "type": "article"
    },
    {
      "title": "Your First 3D Game",
      "url": "https://docs.godotengine.org/en/stable/getting_started/first_3d_game/index.html",
      "type": "article"
    }
  ]
}
