{
  "id": "gsplat",
  "name": "gsplat",
  "version": "1.5.0",
  "description": "High-performance, production-grade Gaussian Splatting library with modular CUDA kernels and PyTorch integration",
  "long_description": "gsplat is a high-performance, open-source library for Gaussian Splatting developed by the Nerfstudio team. It provides optimized CUDA kernels for differentiable rasterization of 3D Gaussians, designed as both a standalone library and as the rendering backbone for Nerfstudio's splatfacto methods. The library focuses on performance, modularity, and correctness, delivering significantly faster training and rendering than the original INRIA implementation.\n\nThe architecture separates rasterization primitives from training logic, enabling researchers to build custom Gaussian Splatting pipelines by composing gsplat's kernels with their own training loops, loss functions, and densification strategies. Key technical features include anti-aliased splatting, support for N-dimensional Gaussians, packed mode for memory-efficient batched rendering, and multiple densification strategies. The library provides a clean Python API that integrates naturally with PyTorch's autograd system.\n\nDistributed under the Apache-2.0 license, gsplat is one of the few permissively-licensed high-performance Gaussian Splatting implementations — a critical distinction for commercial applications and industry adoption. The project is actively developed with regular releases, and has grown beyond its Nerfstudio origins to become a widely-used standalone library in the Gaussian splatting research community. It also integrates with NVIDIA's 3DGUT (3D Gaussian Unification Toolkit) initiative.",
  "technique": ["neural", "gaussian_splatting", "differentiable"],
  "language": "Python/CUDA",
  "license": "Apache-2.0",
  "platforms": ["linux", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["colmap", "images", "ply"],
  "output_formats": ["ply", "png", "ckpt"],
  "homepage": "https://docs.gsplat.studio",
  "repository": "https://github.com/nerfstudio-project/gsplat",
  "documentation": "https://docs.gsplat.studio",
  "paper": "https://arxiv.org/abs/2409.06765",
  "paper_bibtex": "@article{ye2024gsplat,\n  title={gsplat: An Open-Source Library for Gaussian Splatting},\n  author={Ye, Vickie and Turkulainen, Matias and the Nerfstudio Team},\n  journal={arXiv preprint arXiv:2409.06765},\n  year={2024}\n}",
  "first_release": "2023-10-15",
  "latest_release": "2024-12-01",
  "status": "active",
  "tags": [
    "gaussian-splatting",
    "cuda-kernels",
    "differentiable-rasterization",
    "neural-rendering",
    "high-performance",
    "production",
    "research"
  ],
  "strengths": [
    "Significantly faster and more memory-efficient CUDA kernels than the original INRIA implementation — optimized for both training throughput and inference speed",
    "Clean, modular API that separates rasterization primitives from training logic, enabling easy integration into custom pipelines and research projects",
    "Apache-2.0 license enables unrestricted commercial use, unlike the original INRIA implementation's restrictive academic license",
    "Tight integration with Nerfstudio's splatfacto provides a battle-tested path from research prototyping to deployment",
    "Supports advanced features including anti-aliased splatting, N-dimensional Gaussians, packed mode for memory efficiency, and composable densification strategies"
  ],
  "limitations": [
    "NVIDIA CUDA GPUs only — no support for AMD ROCm, Intel oneAPI, or Apple Metal backends",
    "Lower-level API than Nerfstudio — users must write their own training loops and data loading if not using the Nerfstudio integration",
    "Rapid development pace means API stability is not guaranteed between minor versions — pin dependency versions in production",
    "Limited documentation for advanced use cases and kernel customization beyond the standard training pipeline",
    "Requires careful CUDA toolkit and PyTorch version matching for successful installation from source"
  ],
  "best_for": "Developers building custom Gaussian Splatting pipelines who need maximum performance and a permissive license, and as the rendering backbone for Nerfstudio's Gaussian Splatting methods",
  "not_ideal_for": "Users seeking a turnkey training solution with no custom code, projects targeting non-NVIDIA GPUs, or applications requiring a stable long-term API",
  "related": ["3d-gaussian-splatting", "nerfstudio", "instant-ngp", "nerfacc"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": true,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 2500,
  "github_stars_trend": [600, 800, 1000, 1200, 1400, 1600, 1800, 1950, 2100, 2200, 2350, 2500],
  "commit_activity_52w": [4, 6, 5, 3, 7, 8, 5, 4, 6, 9, 7, 5, 8, 6, 4, 7, 10, 8, 6, 5, 9, 7, 11, 8, 6, 5, 7, 9, 8, 10, 6, 7, 12, 9, 8, 7, 6, 10, 8, 11, 7, 9, 6, 8, 10, 7, 9, 11, 8, 6, 10, 9],
  "contributor_count": 35,
  "open_issues": 60,
  "fork_count": 300,
  "integrations": ["Nerfstudio", "PyTorch"],
  "install_command": "pip install gsplat",
  "community_links": {
    "forum": "https://github.com/nerfstudio-project/gsplat/issues"
  },
  "citations": [
    {
      "title": "gsplat: An Open-Source Library for Gaussian Splatting",
      "url": "https://arxiv.org/abs/2409.06765",
      "year": 2024
    }
  ],
  "tutorials": [
    {
      "title": "gsplat Documentation",
      "url": "https://docs.gsplat.studio",
      "type": "article"
    }
  ]
}
