{
  "id": "indigo-renderer",
  "name": "Indigo Renderer",
  "version": "4.4",
  "description": "Unbiased spectral path tracer with physically accurate light simulation, offering a free tier alongside its commercial product",
  "long_description": "Indigo Renderer is a commercial, physically-based, unbiased spectral path tracer developed by Glare Technologies (New Zealand). First released around 2006, it is one of the few production renderers that works in the full spectral domain rather than the standard RGB color space, enabling physically accurate simulation of dispersion, fluorescence, thin-film interference, and other wavelength-dependent phenomena that RGB renderers can only approximate.\n\nIndigo uses Metropolis Light Transport (MLT) and bidirectional path tracing for efficient handling of difficult lighting scenarios such as caustics through glass, complex indirect light paths, and enclosed environments. Its material system is based on physical models with support for subsurface scattering, volumetric rendering, and IES light profiles. The renderer is available as a standalone application and as plugins for Blender, SketchUp, Cinema 4D, 3ds Max, and Revit, with GPU acceleration via OpenCL supporting both NVIDIA and AMD hardware.\n\nIndigo Renderer is the only proprietary renderer in the RenderScope catalog. Its inclusion is justified by two factors: first, its spectral rendering capability represents a category that has no fully open-source equivalent at the same production quality level; second, the free tier (Indigo Free) provides genuine access to the full rendering engine with resolution limits and watermarks, enabling educational comparison. The free tier is useful for understanding what commercial spectral renderers offer versus open-source alternatives like Mitsuba 3 and LuxCoreRender, but it is not suitable for production work without a commercial license.",
  "technique": ["path_tracing"],
  "language": "C++",
  "license": "Proprietary",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["opencl"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["igs", "blend", "skp"],
  "output_formats": ["exr", "png", "hdr"],
  "homepage": "https://www.indigorenderer.com",
  "repository": "https://www.indigorenderer.com",
  "documentation": "https://www.indigorenderer.com/documentation",
  "first_release": "2006-01-01",
  "latest_release": "2024-01-15",
  "latest_release_version": "4.4",
  "status": "active",
  "github_stars": 0,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "tags": [
    "spectral",
    "physically-based",
    "commercial",
    "unbiased",
    "mlt",
    "architectural-visualization",
    "free-tier",
    "proprietary"
  ],
  "strengths": [
    "True spectral rendering engine — works in the wavelength domain rather than RGB, enabling physically accurate simulation of dispersion, fluorescence, thin-film interference, and other wavelength-dependent phenomena",
    "Metropolis Light Transport and bidirectional path tracing handle difficult lighting scenarios like caustics through glass and complex indirect light paths more efficiently than unidirectional path tracing alone",
    "Physically accurate light simulation validated against real-world measurements, making it suitable as a reference renderer for comparing open-source alternatives",
    "Plugin ecosystem spanning Blender, SketchUp, Cinema 4D, 3ds Max, and Revit makes it accessible to artists and architects already using these tools",
    "Free tier provides genuine access to the full rendering engine, allowing educational use and comparison without financial commitment"
  ],
  "limitations": [
    "Proprietary and closed-source — the only non-open-source renderer in the RenderScope catalog, limiting transparency, extensibility, and community contribution",
    "Free tier has resolution limits and watermarks, making it impractical for production use without purchasing a commercial license",
    "No public source code means it cannot serve as a learning resource for understanding renderer internals, unlike PBRT or Mitsuba 3",
    "OpenCL-based GPU rendering has not transitioned to more modern APIs like CUDA OptiX or Vulkan RT, potentially limiting performance on latest hardware",
    "Smaller user community than open-source alternatives like Blender Cycles or LuxCoreRender, resulting in fewer tutorials, materials, and community assets"
  ],
  "best_for": "Reference comparison of spectral rendering quality against open-source alternatives, architectural visualization requiring physically accurate light behavior, and educational exploration of commercial spectral rendering",
  "not_ideal_for": "Open-source workflows, academic research requiring source code access, budget-constrained production work, or users who need to modify or extend the renderer",
  "related": ["luxcorerender", "mitsuba3", "pbrt", "blender-cycles"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": true,
    "metropolis_lt": true,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": true,
    "polarization": false,
    "caustics": true,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": true,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": true,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender", "SketchUp", "Cinema 4D", "3ds Max", "Revit"],
  "install_command": "Download from https://www.indigorenderer.com/download",
  "community_links": {
    "forum": "https://www.indigorenderer.com/forum"
  },
  "citations": [],
  "tutorials": [
    {
      "title": "Indigo Renderer Documentation",
      "url": "https://www.indigorenderer.com/documentation",
      "type": "article"
    }
  ]
}