{
  "id": "instant-ngp",
  "name": "Instant-NGP",
  "version": "1.0",
  "description": "NVIDIA's lightning-fast Neural Graphics Primitives with multiresolution hash encoding for near-instant NeRF training",
  "long_description": "Instant Neural Graphics Primitives (Instant-NGP) is NVIDIA Research's implementation of the breakthrough multiresolution hash encoding technique, published at SIGGRAPH 2022. The core innovation is a learned multiresolution hash table that replaces the costly MLP evaluations in traditional NeRF with fast hash lookups followed by small neural networks, reducing NeRF training from hours to seconds and enabling interactive rendering.\n\nThe implementation is a high-performance C++/CUDA codebase with a fully-fused neural network inference pipeline. Beyond NeRF (neural radiance fields), it supports multiple neural graphics primitives including signed distance functions (SDFs) for geometry, neural images for 2D compression, and neural radiance caching. The system includes an interactive real-time viewer with immediate visual feedback during training, enabling rapid exploration of reconstruction quality across different hyperparameters.\n\nInstant-NGP's hash encoding technique has been one of the most influential contributions in neural rendering — it has been adopted by numerous subsequent works including Nerfstudio, which integrates instant-ngp as one of its built-in methods. While the original NVIDIA repository is no longer actively developed (the team has moved on to newer research), the fundamental technique continues to power many current neural rendering systems. The restrictive NVIDIA Source Code License limits use to non-commercial research.",
  "technique": ["neural", "differentiable", "volume_rendering"],
  "language": "C++/CUDA",
  "license": "Custom (NVIDIA)",
  "platforms": ["linux", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["transforms-json", "colmap", "images", "nerf-synthetic"],
  "output_formats": ["png", "exr", "mp4", "msgpack"],
  "homepage": "https://nvlabs.github.io/instant-ngp/",
  "repository": "https://github.com/NVlabs/instant-ngp",
  "paper": "https://arxiv.org/abs/2201.05989",
  "paper_bibtex": "@article{mueller2022instant,\n  author={M{\\\"u}ller, Thomas and Evans, Alex and Schied, Christoph and Keller, Alexander},\n  title={Instant Neural Graphics Primitives with a Multiresolution Hash Encoding},\n  journal={ACM Transactions on Graphics},\n  volume={41},\n  number={4},\n  pages={102:1--102:15},\n  year={2022},\n  publisher={ACM}\n}",
  "first_release": "2022-01-16",
  "latest_release": "2023-08-01",
  "status": "maintenance",
  "tags": [
    "neural-rendering",
    "nerf",
    "hash-encoding",
    "real-time",
    "nvidia",
    "novel-view-synthesis",
    "cuda",
    "research",
    "siggraph"
  ],
  "strengths": [
    "Pioneered multiresolution hash encoding — a breakthrough that reduced NeRF training from hours to approximately 5 seconds, one of the most influential papers in neural rendering",
    "Full C++/CUDA implementation with fully-fused neural network kernels delivers exceptional performance that remains competitive with newer approaches",
    "Interactive real-time viewer with immediate visual feedback during training enables rapid iteration and scene exploration",
    "Supports multiple neural graphics primitives beyond NeRF including signed distance functions (SDFs), neural images, and neural radiance caching",
    "The hash encoding technique has been widely adopted across the field (Nerfstudio, gsplat ecosystem, and hundreds of research papers), validating its fundamental contribution"
  ],
  "limitations": [
    "NVIDIA-specific custom license restricts all commercial use — viable only for academic research and personal projects",
    "Requires NVIDIA RTX GPU (Turing or newer, compute capability 7.5 or higher) — excludes older GPUs, AMD, Intel, and Apple hardware entirely",
    "C++/CUDA codebase with complex CMake build system makes compilation challenging, especially on Windows where Visual Studio configuration is nontrivial",
    "Limited extensibility — the monolithic C++ architecture makes it significantly harder to modify than Python-based frameworks like Nerfstudio",
    "No longer actively developed as NVIDIA's research focus has moved to newer projects — community must rely on unofficial forks for ongoing bug fixes and improvements"
  ],
  "best_for": "Researchers who need the fastest possible NeRF training and interactive visualization on NVIDIA hardware, and as a reference implementation for hash encoding-based neural rendering",
  "not_ideal_for": "Commercial applications due to restrictive licensing, projects requiring cross-platform GPU support, or workflows needing easy extensibility via Python",
  "related": ["nerfstudio", "3d-gaussian-splatting", "nerfacc", "gsplat"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": false,
    "neural_acceleration": true,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 16000,
  "github_stars_trend": [14000, 14200, 14500, 14800, 15000, 15200, 15400, 15500, 15600, 15700, 15900, 16000],
  "commit_activity_52w": [1, 0, 0, 1, 0, 0, 0, 1, 0, 0, 2, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 1, 0],
  "contributor_count": 40,
  "open_issues": 400,
  "fork_count": 1900,
  "integrations": ["Nerfstudio", "tiny-cuda-nn"],
  "install_command": "git clone --recursive https://github.com/NVlabs/instant-ngp && cd instant-ngp && cmake . -B build -DCMAKE_BUILD_TYPE=RelWithDebInfo && cmake --build build --config RelWithDebInfo -j",
  "community_links": {
    "forum": "https://github.com/NVlabs/instant-ngp/discussions"
  },
  "citations": [
    {
      "title": "Instant Neural Graphics Primitives with a Multiresolution Hash Encoding",
      "url": "https://arxiv.org/abs/2201.05989",
      "year": 2022
    }
  ],
  "tutorials": [
    {
      "title": "Instant-NGP Project Page",
      "url": "https://nvlabs.github.io/instant-ngp/",
      "type": "article"
    }
  ]
}
