{
  "id": "luxcorerender",
  "name": "LuxCoreRender",
  "version": "2.6",
  "description": "Physically based unbiased renderer with both OpenCL and CUDA GPU acceleration and strong Blender integration",
  "long_description": "LuxCoreRender is a physically based, unbiased rendering engine that traces its lineage to LuxRender, which was itself inspired by PBRT. It is designed to produce highly accurate images by faithfully simulating light transport without introducing systematic bias, making it a popular choice for architectural visualization and product rendering where physical plausibility is paramount.\n\nThe renderer supports both CPU and GPU rendering, with GPU acceleration available through both OpenCL and CUDA paths. LuxCoreRender offers a diverse set of integrators including unidirectional and bidirectional path tracing, with photon mapping support through hybrid integrator modes that can handle difficult light transport paths like caustics more efficiently than pure path tracing. It integrates Intel Open Image Denoise for post-process denoising, supports network rendering for distributed workloads, and provides a comprehensive physically based material system.\n\nLuxCoreRender is most commonly used through its Blender integration, BlendLuxCore, which provides a full material editor and render settings panel within Blender's interface. It can also run standalone via command line or through its Python API (pyluxcore). While its community is smaller than Blender Cycles, it maintains an active user forum and benefits from users who specifically value its unbiased rendering approach and bidirectional path tracing capabilities.",
  "technique": ["path_tracing"],
  "language": "C++",
  "license": "Apache-2.0",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda", "opencl"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["luxcore", "gltf", "obj"],
  "output_formats": ["exr", "png", "hdr", "jpg", "tiff"],
  "homepage": "https://luxcorerender.org",
  "repository": "https://github.com/LuxCoreRender/LuxCore",
  "documentation": "https://wiki.luxcorerender.org/",
  "first_release": "2017-01-01",
  "latest_release": "2023-04-01",
  "latest_release_version": "2.6",
  "status": "active",
  "github_stars": 2500,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 60,
  "open_issues": 350,
  "fork_count": 350,
  "tags": [
    "physically-based",
    "unbiased",
    "production",
    "gpu",
    "blender",
    "architectural-visualization",
    "bidirectional",
    "denoising"
  ],
  "strengths": [
    "Emphasis on physically unbiased rendering produces highly accurate images — for scenes where physical plausibility is critical (architectural visualization, product rendering), LuxCoreRender is a strong choice among open-source renderers",
    "Supports bidirectional path tracing and photon mapping through hybrid integrators, enabling efficient rendering of challenging light transport paths like caustics that pure unidirectional path tracers handle poorly",
    "Both OpenCL and CUDA GPU rendering paths provide hardware flexibility, and network rendering support enables distributed rendering across multiple machines",
    "BlendLuxCore integration provides a polished Blender workflow with a dedicated material editor, making it accessible to Blender artists who want higher accuracy than Cycles",
    "Built-in Intel OIDN denoiser integration and multiple tone mapping operators provide a complete pipeline from rendering to final output"
  ],
  "limitations": [
    "Smaller development team and community compared to Blender Cycles means fewer tutorials, slower bug fixes, and less frequent releases — the Blender add-on can lag behind major Blender version updates",
    "GPU rendering paths have feature parity gaps with the CPU path — some advanced features like certain volume rendering modes are only available on CPU",
    "No spectral rendering despite its emphasis on physical accuracy — all light transport is computed in RGB, which is a limitation for applications requiring wavelength-dependent simulation",
    "Scene format is not widely supported by other tools — interoperability primarily relies on the Blender integration rather than direct scene file exchange",
    "Development pace has slowed compared to earlier years, with longer intervals between major releases, raising questions about long-term maintenance trajectory"
  ],
  "best_for": "Architectural visualization and product rendering where physically unbiased rendering and bidirectional path tracing provide measurable accuracy advantages",
  "not_ideal_for": "Real-time applications, spectral rendering research, or users who need the largest possible community and ecosystem of resources",
  "related": ["pbrt", "mitsuba3", "blender-cycles", "appleseed"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": true,
    "metropolis_lt": true,
    "photon_mapping": true,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": true,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": true,
    "denoiser_builtin": true,
    "gpu_rendering": true,
    "multi_gpu": true,
    "network_rendering": true,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": true,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": true,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender"],
  "install_command": "Download from https://luxcorerender.org/download/ or install BlendLuxCore add-on for Blender",
  "community_links": {
    "forum": "https://forums.luxcorerender.org/"
  },
  "citations": [],
  "tutorials": [
    {
      "title": "LuxCoreRender Wiki Documentation",
      "url": "https://wiki.luxcorerender.org/",
      "type": "article"
    },
    {
      "title": "BlendLuxCore Blender Integration Guide",
      "url": "https://wiki.luxcorerender.org/BlendLuxCore_Getting_Started",
      "type": "article"
    }
  ]
}
