{
  "id": "nvdiffrast",
  "name": "nvdiffrast",
  "version": "0.3.3",
  "description": "High-performance modular differentiable rasterization primitives from NVIDIA Research for 3D deep learning",
  "long_description": "nvdiffrast is a library from NVIDIA Research that provides high-performance differentiable rasterization primitives — the fundamental building blocks for constructing custom differentiable rendering pipelines. Rather than offering a complete renderer with built-in shading, materials, and lighting, nvdiffrast exposes four core operations (vertex transformation, rasterization, interpolation, and anti-aliasing) as differentiable modules that researchers compose into application-specific pipelines.\n\nThe library's key technical contribution is its approach to differentiable anti-aliasing, which addresses the discontinuity problem that plagues naive differentiable rasterizers. When object silhouettes move across pixel boundaries during gradient-based optimization, standard rasterization produces zero or incorrect gradients. nvdiffrast solves this by analytically computing coverage at silhouette edges, producing clean gradients that enable reliable optimization of geometry, texture, and camera parameters.\n\nnvdiffrast achieves its performance through custom CUDA kernels with OpenGL or Vulkan interop for hardware-accelerated rasterization, making it fast enough for training loops that require millions of rendering iterations. It supports both PyTorch and TensorFlow as frontend frameworks, though the PyTorch path receives more active maintenance. The library has become a standard backend for several high-profile NVIDIA research projects including nvdiffrec (3D reconstruction) and GET3D (3D generative model), and is integrated into NVIDIA Kaolin as the default differentiable rasterization engine.",
  "technique": ["differentiable", "rasterization"],
  "language": "Python/C++/CUDA",
  "license": "Custom (NVIDIA)",
  "platforms": ["linux", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda", "vulkan"],
  "cpu_support": false,
  "real_time": false,
  "scene_formats": ["programmatic"],
  "output_formats": ["tensor"],
  "homepage": "https://nvlabs.github.io/nvdiffrast/",
  "repository": "https://github.com/NVlabs/nvdiffrast",
  "documentation": "https://nvlabs.github.io/nvdiffrast/",
  "paper": "https://doi.org/10.1145/3478513.3480501",
  "paper_bibtex": "@article{Laine2020diffrast,\n  title={Modular Primitives for High-Performance Differentiable Rendering},\n  author={Laine, Samuli and Hellsten, Janne and Karras, Tero and Seol, Yeongho and Lehtinen, Jaakko and Aila, Timo},\n  journal={ACM Transactions on Graphics},\n  volume={39},\n  number={6},\n  year={2020},\n  publisher={ACM}\n}",
  "first_release": "2020-12-01",
  "latest_release": "2024-06-10",
  "latest_release_version": "0.3.3",
  "status": "active",
  "github_stars": 1400,
  "github_stars_trend": [1050, 1080, 1120, 1160, 1200, 1240, 1270, 1300, 1320, 1350, 1380, 1400],
  "commit_activity_52w": [0, 0, 2, 0, 0, 0, 1, 0, 3, 5, 0, 0, 0, 0, 2, 0, 0, 1, 0, 0, 0, 4, 7, 2, 0, 0, 0, 0, 1, 0, 0, 0, 0, 3, 0, 0, 0, 0, 2, 0, 0, 0, 1, 0, 0, 5, 3, 0, 0, 0, 1, 0],
  "contributor_count": 12,
  "open_issues": 65,
  "fork_count": 180,
  "tags": [
    "differentiable",
    "rasterization",
    "nvidia",
    "cuda",
    "pytorch",
    "tensorflow",
    "modular",
    "high-performance",
    "inverse-rendering",
    "3d-reconstruction"
  ],
  "strengths": [
    "Extremely high throughput through custom CUDA kernels with OpenGL/Vulkan hardware rasterization interop, achieving rendering speeds suitable for training loops with millions of optimization iterations",
    "Modular primitive-based design — rasterize, interpolate, texture, and anti-alias operations are independent differentiable blocks that researchers compose into precisely the pipeline they need, without overhead from unused features",
    "Principled differentiable anti-aliasing that analytically handles edge discontinuities, producing correct silhouette gradients where naive differentiable rasterizers fail or produce zero-gradient artifacts",
    "Proven as the differentiable rasterization backend in high-impact NVIDIA research projects (nvdiffrec, GET3D, Magic3D) and integrated into NVIDIA Kaolin for broader use",
    "Supports both PyTorch and TensorFlow frontends, though PyTorch is the more actively maintained and widely used path"
  ],
  "limitations": [
    "Provides only rasterization primitives, not a complete renderer — users must implement shading, lighting, material models, and the full rendering loop themselves, requiring deep knowledge of the rasterization pipeline",
    "Strictly requires an NVIDIA GPU with CUDA support — there is no CPU fallback, no AMD support, and no Apple Silicon path, limiting accessibility",
    "The NVIDIA Source Code License is more restrictive than standard open source licenses (MIT, BSD, Apache) — users should review the license terms carefully for commercial and redistribution use cases",
    "Steep learning curve for users expecting a high-level rendering API — this is an expert-level tool designed for researchers who understand vertex processing, fragment interpolation, and anti-aliasing at the hardware level"
  ],
  "best_for": "Researchers who need maximum-performance differentiable rasterization primitives and want full control over the rendering pipeline, particularly for large-scale 3D reconstruction, inverse rendering, and generative 3D model training",
  "not_ideal_for": "Users who want a turnkey differentiable renderer with built-in shading and materials — PyTorch3D or NVIDIA Kaolin provide a higher-level experience with less pipeline engineering",
  "related": ["pytorch3d", "nvidia-kaolin", "redner", "drjit", "mitsuba3"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": true,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["NVIDIA Kaolin", "PyTorch", "TensorFlow"],
  "install_command": "pip install nvdiffrast",
  "community_links": {
    "forum": "https://github.com/NVlabs/nvdiffrast/issues"
  },
  "citations": [
    {
      "title": "Modular Primitives for High-Performance Differentiable Rendering",
      "url": "https://doi.org/10.1145/3478513.3480501",
      "year": 2020
    },
    {
      "title": "Extracting Triangular 3D Models, Materials, and Lighting From Images (nvdiffrec)",
      "url": "https://arxiv.org/abs/2111.12503",
      "year": 2022
    }
  ],
  "tutorials": [
    {
      "title": "nvdiffrast Documentation and Samples",
      "url": "https://nvlabs.github.io/nvdiffrast/",
      "type": "article"
    }
  ]
}