{
  "id": "nvidia-kaolin",
  "name": "NVIDIA Kaolin",
  "version": "0.17.0",
  "description": "NVIDIA's comprehensive 3D deep learning library with differentiable rendering, USD support, and extensive geometry processing",
  "long_description": "NVIDIA Kaolin is a PyTorch-based library that provides a broad suite of differentiable 3D operations for deep learning research and applications. Unlike tools focused solely on rendering (PyTorch3D, nvdiffrast), Kaolin is a comprehensive 3D deep learning toolkit covering mesh processing, signed distance functions (SDFs), point cloud operations, voxel grids, differentiable rendering, physics simulation, and — notably — first-class support for Universal Scene Description (USD), the industry-standard scene format used in professional VFX and simulation pipelines.\n\nKaolin's rendering module integrates nvdiffrast as its differentiable rasterization backend, exposing a higher-level API while preserving the underlying performance. It also provides its own differentiable ray tracing capabilities for SDF-based rendering and volumetric representations. The library includes Kaolin Dash3D, an interactive web-based visualizer for real-time inspection of 3D data during training, and supports PBR material models and environment map lighting for more physically plausible differentiable rendering than simple Phong shading.\n\nAs part of the NVIDIA ecosystem, Kaolin is designed for interoperability with Omniverse, Isaac Sim, and other NVIDIA platforms. Its USD support enables researchers to bridge the gap between experimental deep learning workflows and production VFX/simulation pipelines — a capability that is rare among Python 3D libraries. Kaolin requires an NVIDIA GPU for most operations, with Linux as the primary supported platform and Windows as secondary.",
  "technique": ["differentiable", "rasterization", "ray_tracing"],
  "language": "Python/C++/CUDA",
  "license": "Apache-2.0",
  "platforms": ["linux", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["obj", "usd", "gltf", "ply", "programmatic"],
  "output_formats": ["tensor", "png", "usd"],
  "homepage": "https://kaolin.readthedocs.io/en/latest/",
  "repository": "https://github.com/NVIDIAGameWorks/kaolin",
  "documentation": "https://kaolin.readthedocs.io/en/latest/",
  "paper": "https://arxiv.org/abs/1911.05063",
  "paper_bibtex": "@article{jatavallabhula2019kaolin,\n  title={Kaolin: A PyTorch Library for Accelerating 3D Deep Learning Research},\n  author={Jatavallabhula, Krishna Murthy and Smith, Edward and Lafleche, Jean-Francois and Tsang, Clement Fuji and Rozantsev, Artem and Chen, Wenzheng and Xiang, Tommy and Leblanc, Rev and Fidler, Sanja},\n  journal={arXiv preprint arXiv:1911.05063},\n  year={2019}\n}",
  "first_release": "2019-11-18",
  "latest_release": "2024-10-01",
  "latest_release_version": "0.17.0",
  "status": "active",
  "github_stars": 4500,
  "github_stars_trend": [3600, 3750, 3850, 3950, 4050, 4100, 4200, 4250, 4300, 4370, 4430, 4500],
  "commit_activity_52w": [4, 6, 3, 8, 5, 2, 7, 10, 12, 6, 3, 4, 5, 8, 3, 2, 6, 9, 7, 4, 3, 5, 11, 8, 6, 3, 2, 7, 5, 4, 6, 8, 3, 5, 9, 12, 7, 4, 2, 3, 6, 8, 5, 4, 7, 10, 6, 3, 5, 8, 4, 6],
  "contributor_count": 80,
  "open_issues": 90,
  "fork_count": 500,
  "tags": [
    "differentiable",
    "nvidia",
    "3d-deep-learning",
    "usd",
    "pytorch",
    "cuda",
    "mesh-processing",
    "sdf",
    "point-cloud",
    "ray-tracing",
    "inverse-rendering",
    "omniverse"
  ],
  "strengths": [
    "Comprehensive 3D deep learning toolkit that goes far beyond rendering — includes differentiable mesh processing, SDF operations, point cloud utilities, voxel grids, and physics simulation all within a single coherent library",
    "First-class USD (Universal Scene Description) support is rare among Python 3D libraries, enabling direct interoperability with professional VFX and simulation pipelines including NVIDIA Omniverse, Houdini, and Maya",
    "Built-in interactive web visualizer (Kaolin Dash3D) for real-time inspection of 3D data, meshes, point clouds, and neural representations during training — eliminates the need for offline visualization scripts",
    "Integrates nvdiffrast under the hood for high-performance differentiable rasterization while exposing a friendlier, higher-level API with PBR materials and environment lighting support",
    "Active NVIDIA backing with alignment to the broader NVIDIA ecosystem (Omniverse, Isaac Sim, DLSS, OptiX), providing a clear path from research prototypes to production deployment"
  ],
  "limitations": [
    "Heavy dependency footprint requiring specific combinations of CUDA, PyTorch, and system library versions — installation is non-trivial and environment-sensitive, especially for users new to the NVIDIA toolchain",
    "Primarily Linux-focused with Windows as a secondary target — macOS is not officially supported, and Apple Silicon users cannot use the library at all",
    "The rendering module, while capable, is not the primary focus — Kaolin is a broad toolkit, and its renderer is less specialized and less documented than dedicated tools like nvdiffrast or PyTorch3D's rasterizer",
    "Documentation can lag behind the codebase — some newer features and API changes are better documented in code examples and unit tests than in the official API reference",
    "The broad scope means a steeper learning curve for users who only need a single capability (e.g., just differentiable rendering) compared to focused single-purpose tools"
  ],
  "best_for": "Teams working in the NVIDIA ecosystem who need a comprehensive 3D deep learning toolkit with USD interop — especially for projects bridging research and production VFX, simulation, or robotics pipelines",
  "not_ideal_for": "Lightweight setups, AMD or Apple Silicon hardware, or projects that only need a differentiable renderer without the broader 3D processing toolkit — use PyTorch3D or nvdiffrast for a more focused solution",
  "related": ["nvdiffrast", "pytorch3d", "drjit", "mitsuba3", "open3d"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": true,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["NVIDIA Omniverse", "nvdiffrast", "PyTorch"],
  "install_command": "pip install kaolin",
  "community_links": {
    "forum": "https://github.com/NVIDIAGameWorks/kaolin/discussions"
  },
  "citations": [
    {
      "title": "Kaolin: A PyTorch Library for Accelerating 3D Deep Learning Research",
      "url": "https://arxiv.org/abs/1911.05063",
      "year": 2019
    }
  ],
  "tutorials": [
    {
      "title": "Kaolin Documentation",
      "url": "https://kaolin.readthedocs.io/en/latest/",
      "type": "article"
    },
    {
      "title": "Kaolin Tutorials and Recipes",
      "url": "https://github.com/NVIDIAGameWorks/kaolin/tree/master/examples/tutorial",
      "type": "article"
    }
  ]
}