{
  "id": "ogre3d",
  "name": "Ogre3D / OgreNext",
  "version": "14.2.2",
  "description": "Veteran open-source 3D rendering engine with modern Vulkan/Metal backends and a data-oriented architecture",
  "long_description": "Ogre3D (Object-Oriented Graphics Rendering Engine) is one of the longest-running open-source real-time 3D rendering engines, first released publicly in 2001 by Steve Streeting. Over two decades it has been used in commercial games, research projects, simulation tools, and architectural visualization. The project has evolved into two major branches: the classic Ogre 1.x line (OpenGL/Direct3D 9/11) which remains in maintenance, and OgreNext (originally Ogre 2.x), a ground-up rewrite targeting modern graphics APIs.\n\nOgreNext introduces a data-oriented scene manager that dramatically improves rendering throughput on modern hardware. Its HLMS (High Level Material System) replaces the fixed-function heritage of Ogre 1.x with a compute-driven PBR pipeline supporting metallic-roughness workflows, image-based lighting, area lights, and screen-space effects. Backend support spans Vulkan, Direct3D 11, Metal, and OpenGL 3.3+, covering desktop and mobile platforms from a unified codebase.\n\nAs a pure rendering engine — not a full game engine — Ogre provides no built-in physics, audio, scripting, or GUI toolkit. This intentional scope limitation makes it highly composable: teams integrate Ogre with Bullet or Jolt for physics, OpenAL for audio, and custom scripting layers. The trade-off is a steeper integration effort compared to monolithic engines like Godot. The codebase benefits from an extensive plugin architecture, allowing custom render systems, scene managers, and resource codecs to be loaded at runtime without touching the core.",
  "technique": ["rasterization"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows", "ios", "android"],
  "gpu_support": true,
  "gpu_apis": ["vulkan", "metal", "directx"],
  "cpu_support": true,
  "real_time": true,
  "scene_formats": ["mesh-xml", "gltf", "glb", "obj", "dotscene"],
  "output_formats": ["framebuffer", "png", "bmp"],
  "homepage": "https://www.ogre3d.org",
  "repository": "https://github.com/OGRECave/ogre-next",
  "documentation": "https://ogrecave.github.io/ogre-next/api/latest/",
  "first_release": "2001-02-01",
  "latest_release": "2024-09-15",
  "latest_release_version": "14.2.2",
  "status": "active",
  "tags": [
    "game-engine",
    "cross-platform",
    "vulkan",
    "metal",
    "opengl",
    "data-oriented",
    "scene-management",
    "real-time",
    "pbr",
    "plugin-architecture"
  ],
  "strengths": [
    "Over two decades of continuous development and battle-testing in commercial games, simulations, and visualization tools — one of the most mature open-source rendering engines in existence",
    "OgreNext's data-oriented scene manager with compute-based rendering pipelines achieves significantly higher draw call throughput than the classic Ogre 1.x branch",
    "True multi-backend architecture targeting Vulkan, Direct3D 11, Metal, and OpenGL 3.3+ from a single codebase, covering desktop and mobile platforms",
    "Robust plugin architecture enables loading custom render systems, scene managers, particle systems, and resource codecs at runtime without modifying the core engine",
    "Large body of historical knowledge — two decades of forum posts, books, tutorials, and community-contributed resources make troubleshooting easier than for newer engines"
  ],
  "limitations": [
    "Active community has shrunk significantly from its 2000s–2010s peak, with fewer contributors and less third-party ecosystem support than Godot or Bevy",
    "OgreNext broke backward compatibility with the widely-used Ogre 1.x API, fragmenting the community and leaving much historical documentation inapplicable to the modern branch",
    "Purely a rendering engine — no built-in physics, audio, scripting, networking, or GUI toolkit, requiring substantial integration work for a complete application",
    "OgreNext documentation lags behind the codebase in some areas, particularly for newer HLMS features and compute-based workflows",
    "The learning curve is steeper than integrated game engines, especially for developers unfamiliar with graphics programming concepts"
  ],
  "best_for": "Developers who want a mature, pure rendering engine with modern multi-backend support for custom engine development, simulation, or scientific visualization",
  "not_ideal_for": "Teams seeking a batteries-included game engine with built-in physics, scripting, and visual editing tools ready for rapid prototyping",
  "related": ["bgfx", "wicked-engine", "the-forge", "godot", "filament"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": true,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": true,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 4100,
  "github_stars_trend": [3700, 3750, 3800, 3850, 3880, 3910, 3940, 3960, 3990, 4020, 4060, 4100],
  "commit_activity_52w": [8, 12, 6, 15, 9, 11, 7, 14, 10, 8, 13, 6, 9, 11, 15, 7, 12, 8, 10, 14, 6, 9, 11, 7, 13, 8, 15, 10, 12, 6, 9, 14, 11, 7, 8, 13, 10, 6, 15, 9, 12, 11, 7, 8, 14, 10, 13, 6, 9, 11, 8, 12],
  "contributor_count": 120,
  "open_issues": 85,
  "fork_count": 480,
  "integrations": ["Blender (community)"],
  "install_command": "git clone --branch master https://github.com/OGRECave/ogre-next && cd ogre-next && cmake --preset linux-release",
  "community_links": {
    "forum": "https://forums.ogre3d.org"
  },
  "tutorials": [
    {
      "title": "OgreNext Quick Start Guide",
      "url": "https://ogrecave.github.io/ogre-next/api/latest/setting_up.html",
      "type": "article"
    },
    {
      "title": "Ogre3D Wiki",
      "url": "https://wiki.ogre3d.org",
      "type": "article"
    }
  ]
}
