{
  "id": "raylib",
  "name": "raylib",
  "version": "5.5",
  "description": "Beginner-friendly C library for games and graphical applications with zero external dependencies",
  "long_description": "raylib is a simple and easy-to-use C library for videogames programming, created by Ramón Santamaría (raysan5) in 2013. Originally developed as a teaching tool for programming students, it has grown into one of the most popular open-source graphics libraries in the C ecosystem with over 23,000 GitHub stars. The library's design philosophy is inspired by the Borland BGI graphics library and Microsoft XNA framework: provide an API so simple that beginners can produce visual output in their first hour, with function names like DrawCircle(), LoadTexture(), and PlaySound() that read almost like pseudocode.\n\nThe library is written in pure C99 with zero external dependencies — all platform abstraction (windowing, input, OpenGL loading), image decoding, audio playback, and font rendering are implemented internally. The rendering backend uses OpenGL 3.3 on desktop, OpenGL ES 2.0 on mobile and web (via Emscripten), and OpenGL 1.1 for legacy support. raylib supports both 2D and basic 3D rendering, including model loading (glTF, OBJ, IQM, VOX), skeletal animation, basic lighting (up to 4 lights), skybox rendering, mesh generation, and a shader system that allows custom GLSL shaders. An internal OpenGL abstraction layer called rlgl provides lower-level access when the high-level API is insufficient.\n\nWhat sets raylib apart is its extraordinary ecosystem of over 70 community-maintained language bindings, covering virtually every programming language from Python and Rust to Zig, Haskell, and Odin. This has made raylib the de facto standard library for learning graphics programming across languages. The project has an exceptionally active and welcoming community, with over 140 bundled examples, a comprehensive API cheatsheet, and a culture explicitly oriented toward helping beginners. raylib is a library, not an engine — there is no editor, no project system, and no asset pipeline. This is intentional: everything is code-driven, keeping the tool simple and the learning curve gentle.",
  "technique": ["rasterization"],
  "language": "C",
  "license": "Zlib",
  "platforms": ["linux", "macos", "windows", "web", "android"],
  "gpu_support": true,
  "gpu_apis": ["webgl"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["obj", "gltf", "iqm", "vox"],
  "output_formats": ["png"],
  "homepage": "https://www.raylib.com",
  "repository": "https://github.com/raysan5/raylib",
  "documentation": "https://www.raylib.com/cheatsheet/cheatsheet.html",
  "first_release": "2013-11-01",
  "latest_release": "2024-11-18",
  "latest_release_version": "5.5",
  "status": "active",
  "github_stars": 23000,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 500,
  "open_issues": 20,
  "fork_count": 2400,
  "tags": [
    "beginner-friendly",
    "c-language",
    "educational",
    "cross-platform",
    "real-time",
    "prototyping"
  ],
  "strengths": [
    "Arguably the most beginner-friendly graphics library in existence — the API is designed to read like pseudocode (DrawCircle(), LoadModel(), DrawText()), requiring zero boilerplate and enabling students to produce visual output in their first hour of learning",
    "Over 70 community-maintained language bindings make raylib the de facto standard graphics library for learning graphics programming in virtually any language, from Python and Rust to Zig and Haskell",
    "Zero external dependencies — the entire library including windowing, OpenGL loading, image decoding, audio, and font rendering is bundled internally, meaning a single gcc command produces a working graphical application with no package manager or build system required",
    "Cross-platform including web (Emscripten) and Raspberry Pi — one of very few C graphics libraries that genuinely works from embedded Linux framebuffers (DRM/KMS) to WebGL browsers, enabling learning on any hardware",
    "One of the most active and welcoming open-source communities in the C ecosystem, with 140+ bundled examples, a comprehensive API cheatsheet, and a culture explicitly oriented toward helping beginners"
  ],
  "limitations": [
    "Not designed for production game development — lacks the engine-level features (scene graph, entity system, asset pipeline, level editor, visual scripting) that professional game development workflows require",
    "OpenGL 3.3 / ES 2.0 rendering backend provides no access to modern GPU features like compute shaders, Vulkan, ray tracing, or advanced post-processing without dropping down to raw rlgl calls",
    "Basic 3D lighting model supports only 4 simultaneous lights with no global illumination, screen-space ambient occlusion, or advanced shadow techniques — 3D rendering quality is limited compared to engines like Filament or Godot",
    "No built-in physics engine — users must integrate external physics libraries (Bullet, Chipmunk, Box2D) manually, which increases complexity for simulation-heavy projects",
    "The everything-is-a-function-call philosophy means no scene graph, no object lifecycle management, and no data-driven architecture — as projects grow beyond prototyping scale, the lack of structure becomes a significant organizational challenge"
  ],
  "best_for": "Students learning graphics programming, hobbyists prototyping 2D/3D games, game jam participants needing rapid iteration, and programmers in any language wanting the simplest possible path to rendering pixels on screen",
  "not_ideal_for": "Production game development, projects requiring advanced 3D rendering quality, mobile apps targeting App Store/Play Store, large team projects needing engine-level tooling, or applications requiring Vulkan/DX12 capabilities",
  "related": ["sokol", "bgfx", "panda3d", "godot"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": null,
    "caustics": null,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": false,
    "lod_system": false,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "git clone https://github.com/raysan5/raylib && cd raylib/src && make PLATFORM=PLATFORM_DESKTOP",
  "community_links": {
    "forum": "https://github.com/raysan5/raylib/discussions",
    "discord": "https://discord.gg/raylib",
    "stackoverflow_tag": "raylib"
  },
  "citations": [],
  "tutorials": [
    {
      "title": "raylib Examples",
      "url": "https://www.raylib.com/examples.html",
      "type": "article"
    },
    {
      "title": "raylib API Cheatsheet",
      "url": "https://www.raylib.com/cheatsheet/cheatsheet.html",
      "type": "article"
    }
  ]
}
