{
  "id": "raytracing-in-one-weekend",
  "name": "Ray Tracing in One Weekend",
  "version": "4.0.1",
  "description": "Peter Shirley's beloved educational book series that guides readers through building a ray tracer from scratch in C++",
  "long_description": "Ray Tracing in One Weekend is a three-book series by Peter Shirley (later co-authored with Trevor David Black and Steve Hollasch) that has become the most widely used introductory resource for learning ray tracing. Originally self-published as PDFs around 2013, the series is now freely available online and covers building a complete path tracer incrementally: Book 1 introduces ray-sphere intersection, antialiasing, diffuse materials, metals, dielectrics, and defocus blur; Book 2 adds motion blur, BVH acceleration, textures, lights, and volumes; Book 3 covers Monte Carlo methods, importance sampling, and PDFs.\n\nThe code is intentionally minimal — no external dependencies beyond a C++ compiler — and builds from zero to a functional path tracer that produces correct global illumination. Scenes are constructed directly in C++ code, and output is in PPM format. The design choices prioritize pedagogical clarity: the code is single-threaded and CPU-only, with no acceleration structures until Book 2. This deliberate simplicity means the reader can trace every line of code and understand exactly what the renderer is doing.\n\nThe series has had an extraordinary impact on the computer graphics community. Countless professional graphics engineers cite these books as their entry point into rendering, and they are assigned reading in university computer graphics courses worldwide. The CC0 (public domain) license means the code can be freely used, modified, and incorporated into any project. Peter Shirley, an NVIDIA Distinguished Scientist and co-author of the Fundamentals of Computer Graphics textbook, continues to maintain and update the series with corrections and modern C++ practices.",
  "technique": ["ray_tracing", "path_tracing"],
  "language": "C++",
  "license": "CC0-1.0",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["hardcoded"],
  "output_formats": ["ppm"],
  "homepage": "https://raytracing.github.io",
  "repository": "https://github.com/RayTracing/raytracing.github.io",
  "documentation": "https://raytracing.github.io",
  "first_release": "2013-01-01",
  "latest_release": "2024-08-31",
  "latest_release_version": "4.0.1",
  "status": "active",
  "github_stars": 9500,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 45,
  "open_issues": 30,
  "fork_count": 900,
  "tags": [
    "educational",
    "ray-tracing",
    "path-tracing",
    "textbook",
    "beginner",
    "monte-carlo",
    "minimal",
    "public-domain"
  ],
  "strengths": [
    "Arguably the most successful educational resource in computer graphics — has introduced hundreds of thousands of programmers to ray tracing through clear, incremental, hands-on implementation",
    "Zero-dependency approach means anyone with a C++ compiler can follow along with no package managers, build systems, or external libraries, lowering the barrier to entry to near-zero",
    "Three-book progression takes readers from basic ray-sphere intersection to Monte Carlo importance sampling, covering both practical implementation and mathematical foundations",
    "CC0 (public domain) license means the code can be freely used, modified, and incorporated into any project without any restrictions — commercial, academic, or personal",
    "Actively maintained with periodic updates adding corrections, improved explanations, and modern C++ practices"
  ],
  "limitations": [
    "Not a production renderer — the resulting code is intentionally simple and pedagogical, lacking optimizations like SIMD, GPU acceleration, and denoising that production renderers require",
    "Single-threaded, CPU-only design means rendering any non-trivial scene takes minutes to hours — performance is deliberately not a goal",
    "No scene description format — scenes must be authored directly in C++ code, which limits practical use beyond learning exercises",
    "Outputs only PPM images, requiring conversion for modern use, though this simplicity is deliberate to avoid I/O library dependencies",
    "Limited material system compared to full renderers — covers Lambertian, metal, and dielectric but not the full range of BSDF models used in research or production"
  ],
  "best_for": "Absolute beginners learning ray tracing fundamentals, CS students in introductory graphics courses, and self-taught programmers wanting a hands-on weekend project that builds real understanding",
  "not_ideal_for": "Production rendering, research requiring advanced features, benchmarking, or any use case requiring performance, scalability, or diverse scene formats",
  "related": ["smallpt", "pbrt", "sort", "tungsten"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": true,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "git clone https://github.com/RayTracing/raytracing.github.io && cd raytracing.github.io && cmake -B build && cmake --build build",
  "community_links": {},
  "citations": [
    {
      "title": "Ray Tracing in One Weekend (Book Series)",
      "url": "https://raytracing.github.io",
      "year": 2024
    }
  ],
  "tutorials": [
    {
      "title": "Ray Tracing in One Weekend Online Books",
      "url": "https://raytracing.github.io",
      "type": "article"
    }
  ]
}