{
  "id": "smallpt",
  "name": "smallpt",
  "version": "1.0",
  "description": "99-line educational global illumination renderer demonstrating Monte Carlo path tracing in minimal C++",
  "long_description": "smallpt is a global illumination renderer written in just 99 lines of C++ by Kevin Beason in 2007. It implements a fully functional, physically correct unbiased Monte Carlo path tracer with Russian roulette path termination, tent filter anti-aliasing, and support for diffuse, perfectly specular, and ideal refractive (glass) surfaces. The entire scene — a modified Cornell Box with two spheres — is hardcoded in the source. Despite its extreme brevity, the algorithm is not an approximation: it produces a mathematically correct solution to the rendering equation.\n\nThe renderer uses only spheres as geometric primitives, performs brute-force ray-sphere intersection testing without any acceleration structure, and outputs a single PPM image file. It has no external dependencies beyond the C++ standard library and OpenMP pragmas for optional parallelism. The 99-line version is deliberately compressed and nearly unreadable; the educational value comes primarily from annotated and expanded versions created by the community, which typically span 200-300 lines. Configuration is limited to resolution and sample count via command-line arguments or source code modification.\n\nsmallpt is arguably the most famous minimal renderer in existence and occupies a unique niche in the rendering ecosystem. It has spawned an entire family of educational extensions — smallptGPU, smallpaint, smallvol, and numerous annotated versions — that collectively form one of the best introductory resources for understanding path tracing. It is universally cited in university computer graphics courses, conference talks, blog posts, and textbooks as the canonical example of how simple a physically correct global illumination renderer can be. It is the \"hello world\" of path tracing.",
  "technique": ["path_tracing"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["hardcoded"],
  "output_formats": ["ppm"],
  "homepage": "https://kevinbeason.com/smallpt/",
  "repository": "https://kevinbeason.com/smallpt/",
  "first_release": "2007-01-01",
  "latest_release": "2007-01-01",
  "status": "archived",
  "github_stars": 0,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 1,
  "open_issues": 0,
  "fork_count": 0,
  "tags": [
    "educational",
    "minimalist",
    "path-tracing",
    "offline",
    "historical",
    "reference-implementation",
    "monte-carlo",
    "global-illumination"
  ],
  "strengths": [
    "Demonstrates that a complete, physically correct Monte Carlo path tracer with global illumination, specular reflection, and refraction fits in just 99 lines of C++ — an unmatched demonstration of algorithmic elegance",
    "Zero external dependencies and no build system complexity — compiles with a single g++ command on any platform with a C++ compiler, making it the most accessible possible introduction to rendering",
    "Has spawned an entire ecosystem of educational extensions (GPU versions, volumetric variants, annotated expansions) that collectively form one of the best introductory resources for understanding path tracing",
    "The underlying algorithm is physically correct — an unbiased Monte Carlo estimator with Russian roulette termination — not a toy approximation, but a real solution to the rendering equation",
    "Universally cited in university computer graphics courses, conference talks, and textbooks as the canonical example of the minimum viable path tracer"
  ],
  "limitations": [
    "Supports only sphere primitives with no triangle meshes or arbitrary geometry, making it unsuitable for any rendering task beyond its single hardcoded Cornell Box scene",
    "The 99-line version uses deliberately compressed code formatting that is nearly unreadable — educational value comes primarily from community-created annotated and expanded versions",
    "No scene file format, no configuration, and no material system — every change requires modifying and recompiling the source code",
    "No features beyond basic path tracing — no textures, no volumetrics, no depth of field, no motion blur, no denoiser, no acceleration structure, and brute-force O(n) intersection testing",
    "Exists purely as a teaching tool and demonstration — attempting to extend it into a practical renderer defeats its purpose and is better served by starting with PBRT or Tungsten"
  ],
  "best_for": "First introduction to path tracing for students and self-learners, demonstrating the core Monte Carlo rendering algorithm in absolute minimum code, and as a starting point for building educational renderers",
  "not_ideal_for": "Any practical rendering — not for production, research benchmarking, or any task beyond education and algorithmic demonstration",
  "related": ["pbrt", "sort", "tungsten", "povray"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "community_links": {},
  "tutorials": [
    {
      "title": "smallpt — Global Illumination in 99 Lines of C++",
      "url": "https://kevinbeason.com/smallpt/",
      "type": "article"
    }
  ]
}