{
  "id": "softrasterizer",
  "name": "SoftRasterizer",
  "version": "git-2019",
  "description": "Differentiable mesh renderer using soft rasterization for gradient flow through occlusion boundaries",
  "long_description": "SoftRasterizer (SoftRas) introduced the concept of soft rasterization for differentiable mesh rendering, enabling gradients to flow through the traditionally non-differentiable rasterization process. Published at NeurIPS 2019 by Shichen Liu, Tianye Li, Weikai Chen, and Hao Li from the University of Southern California and Pinscreen, it replaces the hard pixel-face assignment in standard rasterization with a probabilistic (soft) assignment based on a sigmoid-like aggregate function, making the entire rendering pipeline differentiable with respect to vertex positions, colors, and normals.\n\nThe core insight is elegant: by treating each triangle's influence on a pixel as a smooth probability rather than a binary occupancy, SoftRas enables gradient-based optimization of 3D mesh geometry from 2D image supervision. This was one of the earliest works to demonstrate end-to-end differentiable mesh rendering and directly influenced the design of PyTorch3D's differentiable rasterizer, nvdiffrast, and other subsequent systems in the differentiable rendering ecosystem.\n\nAs a research prototype, SoftRasterizer provides a clean, readable implementation that maps closely to the paper's mathematical formulation. It supports silhouette-based and shaded image supervision with basic Phong shading and per-vertex colors. The codebase remains widely cited (500+ papers) and serves as an important historical reference for understanding differentiable rendering, though production users are better served by more actively maintained tools like PyTorch3D or nvdiffrast that have adopted and extended its foundational ideas.",
  "technique": ["differentiable", "rasterization"],
  "language": "Python/CUDA",
  "license": "MIT",
  "platforms": ["linux"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": false,
  "real_time": false,
  "scene_formats": ["obj"],
  "output_formats": ["tensor", "png"],
  "homepage": "https://github.com/ShichenLiu/SoftRas",
  "repository": "https://github.com/ShichenLiu/SoftRas",
  "paper": "https://arxiv.org/abs/1904.01786",
  "paper_bibtex": "@inproceedings{liu2019softras,\n  title={Soft Rasterizer: A Differentiable Renderer for Image-based 3D Reasoning},\n  author={Liu, Shichen and Li, Tianye and Chen, Weikai and Li, Hao},\n  booktitle={Advances in Neural Information Processing Systems (NeurIPS)},\n  year={2019}\n}",
  "first_release": "2019-04-01",
  "latest_release": "2019-12-01",
  "latest_release_version": "git-2019",
  "status": "inactive",
  "github_stars": 1300,
  "github_stars_trend": [1050, 1080, 1100, 1120, 1150, 1170, 1190, 1210, 1230, 1250, 1270, 1300],
  "commit_activity_52w": [0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0],
  "contributor_count": 5,
  "open_issues": 45,
  "fork_count": 210,
  "tags": [
    "differentiable-rendering",
    "soft-rasterization",
    "inverse-rendering",
    "pytorch",
    "cuda",
    "mesh-rendering",
    "3d-reconstruction",
    "neurips-2019"
  ],
  "strengths": [
    "Pioneered the soft rasterization approach to differentiable rendering — the foundational concept has been adopted by PyTorch3D, and the paper (NeurIPS 2019) is cited by over 500 subsequent works in differentiable rendering and 3D reconstruction",
    "Clean, readable research code that maps directly to the paper's mathematical formulation, making it an excellent educational reference for understanding how differentiable rasterization works at a fundamental level",
    "Supports both silhouette-based and shaded image supervision, enabling gradient-based mesh reconstruction from single or multi-view 2D images without 3D ground truth",
    "MIT license allows unrestricted use in both academic research and commercial applications"
  ],
  "limitations": [
    "Research prototype with no ongoing maintenance — the repository has seen no updates since 2019, and compatibility with recent PyTorch and CUDA versions is not guaranteed",
    "Limited shading model restricted to basic Phong shading — no PBR materials, environment maps, or advanced lighting, limiting the visual realism of rendered outputs",
    "Performance has been significantly surpassed by PyTorch3D and nvdiffrast, which offer optimized CUDA kernels with hardware-accelerated rasterization",
    "Requires NVIDIA CUDA-capable GPU with no CPU fallback, limiting accessibility on non-NVIDIA hardware",
    "Supports only triangle meshes via OBJ loading — no point clouds, volumes, curves, or other geometry types"
  ],
  "best_for": "Understanding the foundations of differentiable mesh rendering and reproducing the original SoftRas paper results",
  "not_ideal_for": "Production differentiable rendering pipelines — use PyTorch3D or nvdiffrast instead, which offer better performance, broader features, and active maintenance",
  "related": ["pytorch3d", "nvdiffrast", "deodr", "nvidia-kaolin"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": true,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["PyTorch"],
  "citations": [
    {
      "title": "Soft Rasterizer: A Differentiable Renderer for Image-based 3D Reasoning",
      "url": "https://arxiv.org/abs/1904.01786",
      "year": 2019
    }
  ],
  "tutorials": []
}