{
  "id": "sokol",
  "name": "Sokol",
  "version": "git-main",
  "description": "Minimal set of cross-platform single-file C headers for 3D rendering with zero dependencies",
  "long_description": "Sokol (meaning \"falcon\" in several Slavic languages) is a collection of single-file, cross-platform C header libraries for building graphical applications, created and maintained by Andre Weissflog (floooh), a veteran engine programmer. The core design philosophy is radical minimalism: each header solves one specific problem with zero external dependencies. The primary rendering header, sokol_gfx.h, provides a cross-platform 3D rendering API abstraction that compiles natively to Metal (macOS/iOS), D3D11 (Windows), OpenGL 3.3 / OpenGL ES 3.0 (Linux/Android/Web), and experimental WebGPU — all from a single API surface.\n\nSokol is explicitly not a rendering engine or game engine — it is a rendering abstraction layer that provides low-level GPU primitives (buffers, shaders, pipelines, render passes) but no scene graph, material system, lighting, or any high-level rendering features. The Sokol family includes additional headers: sokol_app.h (window/input), sokol_audio.h (audio), sokol_time.h (timing), sokol_fetch.h (async I/O), sokol_imgui.h (Dear ImGui integration), and sokol_shape.h (shape generation). The companion shader cross-compiler sokol-shdc compiles annotated GLSL into native shader formats for every backend (HLSL, MSL, GLSL variants, WGSL), solving one of the most painful problems in cross-platform GPU programming.\n\nThe project occupies the niche of \"minimal GPU rendering access in C with absolute minimum fuss.\" Web support is first-class — Sokol was designed from the start to work with Emscripten, and the author maintains an extensive collection of live web demos. Community-maintained bindings exist for Zig, Odin, Rust, and Nim. Sokol competes not with game engines but with raw OpenGL/Vulkan/Metal API usage and with similar abstraction libraries like bgfx. Its value proposition is simplicity, portability, and an extremely small binary footprint, making it ideal for embedded applications, demos, and size-constrained environments.",
  "technique": ["rasterization"],
  "language": "C",
  "license": "Zlib",
  "platforms": ["linux", "macos", "windows", "web", "android", "ios"],
  "gpu_support": true,
  "gpu_apis": ["metal", "directx", "webgl", "webgpu"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["custom"],
  "output_formats": ["framebuffer"],
  "homepage": "https://github.com/floooh/sokol",
  "repository": "https://github.com/floooh/sokol",
  "documentation": "https://github.com/floooh/sokol/tree/master/docs",
  "first_release": "2017-01-01",
  "latest_release": "2024-10-01",
  "latest_release_version": "git-main",
  "status": "active",
  "github_stars": 7000,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 40,
  "open_issues": 30,
  "fork_count": 450,
  "tags": [
    "minimal",
    "header-only",
    "c-language",
    "cross-platform",
    "real-time",
    "embedded"
  ],
  "strengths": [
    "Ultimate in minimalism — each header is a single C file with zero dependencies, making integration trivially simple: include the header and compile, with no build systems, package managers, or linking against external libraries required",
    "Compiles natively to Metal, D3D11, OpenGL, and WebGPU backends from a single API surface, achieving genuine cross-platform rendering including first-class web support via Emscripten without any changes to application code",
    "Extremely small binary size and fast compilation times make it ideal for embedded applications, demos, game jams, and size-constrained environments where a full engine or rendering framework would be excessive overhead",
    "Exceptionally well-maintained by a veteran engine programmer with a clean, thoroughly documented codebase and an extensive collection of live web examples demonstrating practical rendering techniques",
    "The sokol-shdc shader cross-compiler solves one of the most painful problems in cross-platform rendering: writing shaders once in annotated GLSL and compiling them to every backend's native shader language automatically"
  ],
  "limitations": [
    "Provides only low-level rendering primitives (buffers, shaders, pipelines, render passes) with no scene graph, material system, lighting, physics, or asset pipeline — users must build everything above the GPU abstraction themselves",
    "Not suitable for developers who want a productive out-of-the-box experience; building a 3D application with Sokol requires significantly more code and GPU programming expertise than using a framework like Filament or an engine like Godot",
    "No built-in support for any rendering features (PBR materials, global illumination, shadow mapping, post-processing) — these are left entirely to the user to implement via custom shaders and render passes",
    "Limited to the capabilities of its most constrained backend (OpenGL ES 3.0 / WebGL 2) in practice, which means advanced GPU features like compute shaders and hardware ray tracing are not available through the Sokol API",
    "Single-maintainer project — while actively developed and high-quality, bus factor of one means long-term support depends on one individual's continued involvement"
  ],
  "best_for": "Systems programmers and C developers who want a minimal, dependency-free GPU rendering abstraction for cross-platform applications, demos, game jams, or embedded projects where framework overhead is unacceptable",
  "not_ideal_for": "Developers wanting a productive high-level 3D framework, artists needing visual tools, projects requiring advanced rendering features out of the box, or teams needing guaranteed long-term commercial support",
  "related": ["bgfx", "raylib", "filament", "the-forge"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": null,
    "caustics": null,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": false,
    "screen_space_effects": false,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "git clone https://github.com/floooh/sokol",
  "community_links": {},
  "citations": [],
  "tutorials": [
    {
      "title": "Sokol Samples — Collection of example programs",
      "url": "https://github.com/floooh/sokol-samples",
      "type": "article"
    }
  ]
}
