{
  "id": "sort",
  "name": "SORT",
  "version": "1.0",
  "description": "Simple Open-source Ray Tracer designed for education and rendering algorithm experimentation with a visual editor",
  "long_description": "SORT (Simple Open-source Ray Tracer) is a physically based renderer created and maintained by Jiayin Cao, a professional graphics engineer who has worked at major technology and game companies. Designed primarily as a personal learning project and educational showcase, SORT is used by its author to demonstrate, experiment with, and compare implementations of modern rendering algorithms — bridging the gap between toy educational renderers and production-grade systems.\n\nDespite its educational orientation, SORT features a surprisingly complete rendering pipeline. It implements multiple integrators — unidirectional path tracing, bidirectional path tracing, light tracing, instant radiosity, ambient occlusion, and Whitted-style ray tracing — all within a single well-structured codebase that enables direct comparison of different algorithms on the same scenes. The renderer supports Disney BRDF materials, subsurface scattering, depth of field, HDRI environment lighting, and geometric instancing. It uses Intel Embree for ray-scene intersection acceleration and supports multi-threaded rendering. Notably for an educational project, SORT includes a dedicated visual scene and material editor (SORT Editor), a separate GUI application for authoring scenes and node-based materials.\n\nSORT continues to receive periodic updates as its author experiments with new rendering techniques. The codebase is well-commented and explicitly structured for readability rather than maximum performance, making it an excellent study resource for intermediate-to-advanced graphics students who have outgrown minimal examples like smallpt but find production renderers like PBRT overwhelming in scope. The accompanying blog posts by Jiayin Cao provide detailed explanations of the algorithms implemented.",
  "technique": ["path_tracing", "ray_tracing"],
  "language": "C++",
  "license": "GPL-3.0-only",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["sort-xml"],
  "output_formats": ["png", "bmp", "jpg", "exr", "hdr"],
  "homepage": "https://github.com/JiayinCao/SORT",
  "repository": "https://github.com/JiayinCao/SORT",
  "first_release": "2016-01-01",
  "latest_release": "2024-01-01",
  "status": "active",
  "github_stars": 850,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 3,
  "open_issues": 10,
  "fork_count": 120,
  "tags": [
    "educational",
    "research",
    "path-tracing",
    "ray-tracing",
    "physically-based",
    "offline",
    "clean-code",
    "visual-editor",
    "disney-brdf"
  ],
  "strengths": [
    "Well-commented and cleanly structured C++ codebase explicitly written for readability, making it an excellent study resource for intermediate-to-advanced graphics students learning modern rendering algorithms",
    "Includes a dedicated visual scene and material editor (SORT Editor), which is rare for educational renderers and makes experimentation much more accessible than text-only scene formats",
    "Multiple integrator implementations — path tracing, bidirectional path tracing, light tracing, instant radiosity — in a single codebase allow direct comparison of different algorithms on the same scenes",
    "Disney BRDF material model implementation provides modern physically based materials, bridging the gap between toy renderers and production systems",
    "Actively maintained by a working graphics engineer who brings professional industry experience to an educational codebase with periodic algorithm additions"
  ],
  "limitations": [
    "GPL-3.0 license restricts use in proprietary or commercial projects — the copyleft requirement may discourage integration into company-internal tools or commercial products",
    "CPU-only rendering with no GPU acceleration path limits practical use for scenes of any significant complexity",
    "Very small community beyond the author — no forum, no Discord, and very few external contributors, meaning users cannot easily get help beyond reading source code and blog posts",
    "Not designed for production use — lacks the robustness, error handling, and edge-case coverage that production renderers require for reliable daily use",
    "Scene ecosystem is minimal — few pre-made scenes exist outside the bundled examples, and the SORT Editor has a limited feature set compared to full DCC tools"
  ],
  "best_for": "Intermediate-to-advanced graphics students studying modern rendering algorithms, developers wanting a readable reference for BDPT and Disney BRDF implementation, and engineers prototyping techniques before implementing them in production systems",
  "not_ideal_for": "Production rendering, GPU-accelerated workflows, commercial projects requiring a permissive license, or beginners who need extensive tutorials and community support",
  "related": ["pbrt", "tungsten", "smallpt", "appleseed"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": true,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": true,
    "motion_blur": false,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender"],
  "community_links": {},
  "tutorials": [
    {
      "title": "Jiayin Cao's Graphics Blog",
      "url": "https://agraphicsguynotes.com/",
      "type": "article"
    }
  ]
}