{
  "id": "tensorflow-graphics",
  "name": "TensorFlow Graphics",
  "version": "2021.12.3",
  "description": "Google's collection of differentiable graphics layers for 3D reasoning within the TensorFlow ecosystem",
  "long_description": "TensorFlow Graphics is a library of differentiable graphics modules developed by Google Research, providing building blocks for 3D reasoning within TensorFlow computational graphs. Rather than a single renderer, it offers a comprehensive collection of modules covering differentiable rendering, camera models, 3D transformations, mesh operations, point cloud processing, and geometric utilities — all designed to be composable within TensorFlow training pipelines.\n\nReleased publicly in May 2019 and announced at CVPR, the library brought Google's internal 3D graphics research tooling to the open-source community. The rendering module supports differentiable rasterization with interpolated vertex attributes, enabling gradient-based optimization of 3D geometry from 2D image supervision. Additional modules provide spherical harmonics, sRGB/linear color space conversion, quaternion and rotation matrix operations, and various interpolation methods — a breadth of differentiable graphics primitives that distinguishes it from more narrowly focused rendering tools.\n\nTensorFlow Graphics has seen significantly reduced development activity since 2021, as Google's internal graphics research has shifted toward JAX-based tools and frameworks. While the library remains functional with recent TensorFlow versions and still receives occasional maintenance, no new features are being added. For new projects, the PyTorch ecosystem (PyTorch3D, nvdiffrast) offers more active development and broader community support. However, for teams already invested in TensorFlow infrastructure, the library provides a stable, well-structured set of differentiable graphics primitives with Google-quality code standards.",
  "technique": ["differentiable", "rasterization"],
  "language": "Python",
  "license": "Apache-2.0",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["obj", "programmatic"],
  "output_formats": ["tensor", "png"],
  "homepage": "https://github.com/tensorflow/graphics",
  "repository": "https://github.com/tensorflow/graphics",
  "documentation": "https://www.tensorflow.org/graphics/overview",
  "paper": "https://arxiv.org/abs/2007.12474",
  "paper_bibtex": "@article{valentin2019tensorflow,\n  title={TensorFlow Graphics: Computer Graphics Meets Deep Learning},\n  author={Valentin, Julien and Keskin, Cem and Pidlypenskyi, Pavel and Makadia, Ameesh and Sud, Avneesh and Bouaziz, Sofien},\n  journal={arXiv preprint arXiv:2007.12474},\n  year={2019}\n}",
  "first_release": "2019-05-09",
  "latest_release": "2021-12-03",
  "latest_release_version": "2021.12.3",
  "status": "maintenance",
  "github_stars": 2800,
  "github_stars_trend": [2500, 2530, 2560, 2590, 2620, 2650, 2680, 2700, 2720, 2740, 2770, 2800],
  "commit_activity_52w": [0, 0, 1, 0, 0, 0, 0, 0, 2, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 0],
  "contributor_count": 50,
  "open_issues": 180,
  "fork_count": 430,
  "tags": [
    "differentiable-rendering",
    "tensorflow",
    "google",
    "3d-reasoning",
    "camera-models",
    "mesh-processing",
    "point-cloud",
    "transformations",
    "graphics-library"
  ],
  "strengths": [
    "Comprehensive library covering not just rendering but also camera models, 3D transformations, mesh processing, and geometric utilities — all differentiable and composable within TensorFlow computational graphs",
    "Seamless integration with the broader TensorFlow and Keras ecosystem enables plug-and-play incorporation of 3D graphics operations into existing training pipelines without framework boundaries",
    "Pure Python/TensorFlow implementation with no custom CUDA compilation step — works on any platform that supports TensorFlow, including TPUs for distributed training",
    "Modular architecture with well-separated concerns makes individual components easy to study and use independently — valuable as an educational resource for understanding differentiable graphics primitives",
    "Apache-2.0 license with Google institutional code quality standards and code review practices"
  ],
  "limitations": [
    "Development activity has stalled significantly since 2021 — the library receives occasional maintenance but no new features, and Google's internal 3D research has shifted to JAX-based tools",
    "Rendering performance lags behind PyTorch3D and nvdiffrast due to the absence of custom CUDA kernels — the pure TensorFlow approach trades performance for portability",
    "The TensorFlow ecosystem for 3D graphics is substantially smaller than PyTorch's — fewer tutorials, fewer community projects, less active support, and diminishing researcher interest",
    "Rendering module is limited to basic rasterization with no PBR, volumetric rendering, global illumination, or advanced material models — designed for geometric reasoning, not visual fidelity",
    "Some modules are incomplete or experimental, and documentation coverage varies significantly across the library's many submodules"
  ],
  "best_for": "Differentiable graphics operations within existing TensorFlow training pipelines, particularly for researchers already committed to the TensorFlow ecosystem",
  "not_ideal_for": "New projects — the PyTorch ecosystem (PyTorch3D, nvdiffrast) is more actively maintained with broader community support and is not suitable for high-performance rendering",
  "related": ["pytorch3d", "nvdiffrast", "deodr", "softrasterizer"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": true,
    "inverse_rendering": true,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["TensorFlow", "Keras"],
  "install_command": "pip install tensorflow-graphics",
  "community_links": {
    "stackoverflow_tag": "tensorflow-graphics"
  },
  "citations": [
    {
      "title": "TensorFlow Graphics: Computer Graphics Meets Deep Learning",
      "url": "https://arxiv.org/abs/2007.12474",
      "year": 2019
    }
  ],
  "tutorials": [
    {
      "title": "TensorFlow Graphics Overview",
      "url": "https://www.tensorflow.org/graphics/overview",
      "type": "article"
    }
  ]
}