{
  "id": "the-forge",
  "name": "The Forge",
  "version": "1.58",
  "description": "Cross-platform rendering framework used in AAA game development, supporting Vulkan, DX12, and Metal",
  "long_description": "The Forge is a cross-platform rendering framework developed by Confetti Interactive, led by Wolfgang Engel and his team of veteran graphics engineers. Unlike most open-source rendering projects, The Forge has been deployed in shipped AAA titles — most notably Supergiant Games' Hades and Hades II — giving it a level of production validation that is rare in the open-source rendering ecosystem. The framework provides a unified low-level rendering API that abstracts over Vulkan, DirectX 12, Metal, and console-specific APIs (GNM/GNMX for PlayStation, proprietary APIs for Xbox and Nintendo Switch behind NDA).\n\nThe Forge's architecture centers on GPU-driven rendering pipelines, with extensive support for indirect drawing, compute-based culling, and asynchronous resource management. It includes FSL (Forge Shading Language), a custom cross-platform shader language that compiles to all supported backends, eliminating the need to maintain separate HLSL, MSL, and GLSL shader codebases. The framework also provides an OS abstraction layer, a custom memory allocator, font rendering, a UI system, and comprehensive profiler integration.\n\nAs a rendering framework rather than a game engine, The Forge intentionally excludes physics, audio, scripting, and scene editing. It targets experienced graphics engineers who are building their own engine or rendering pipeline and need a proven, production-quality GPU abstraction. The project maintains an extensive automated test suite that runs across multiple GPU architectures, and its release cadence follows a continuous improvement model with frequent updates. Console support is available under NDA from the respective platform holders.",
  "technique": ["rasterization", "ray_tracing"],
  "language": "C/C++",
  "license": "Apache-2.0",
  "platforms": ["linux", "macos", "windows", "ios", "android"],
  "gpu_support": true,
  "gpu_apis": ["vulkan", "metal", "directx"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["gltf", "glb", "obj", "custom"],
  "output_formats": ["framebuffer", "png"],
  "homepage": "https://theforge.dev",
  "repository": "https://github.com/ConfettiFX/The-Forge",
  "documentation": "https://github.com/ConfettiFX/The-Forge/wiki",
  "first_release": "2017-08-01",
  "latest_release": "2024-11-15",
  "latest_release_version": "1.58",
  "status": "active",
  "tags": [
    "rendering-framework",
    "cross-platform",
    "aaa",
    "vulkan",
    "directx-12",
    "metal",
    "ray-tracing",
    "gpu-driven",
    "production",
    "real-time"
  ],
  "strengths": [
    "Proven in shipped AAA titles including Supergiant Games' Hades and Hades II — the only open-source rendering framework with this level of commercial game validation",
    "True cross-platform GPU API covering Vulkan, DirectX 12, Metal, and console-specific backends (PlayStation, Xbox, Nintendo Switch) from a single codebase",
    "FSL (Forge Shading Language) enables writing shaders once for all backends, eliminating the maintenance burden of separate HLSL, MSL, and GLSL codebases",
    "GPU-driven rendering architecture with compute-based culling, indirect drawing, and asynchronous resource management designed for maximum hardware utilization",
    "Exceptionally thorough automated test suite running across multiple GPU architectures, providing confidence in cross-platform correctness"
  ],
  "limitations": [
    "Steep learning curve — the framework is designed for experienced graphics engineers and the codebase is large, requiring significant ramp-up time",
    "Not a complete game engine — no built-in editor, physics engine, audio system, or scripting runtime; purely a rendering and OS abstraction framework",
    "Console support (PlayStation, Xbox, Nintendo Switch) requires NDA access to respective platform SDKs and is unavailable in the public open-source version",
    "Documentation is sparse relative to the framework's complexity — learning requires reading extensive example code, unit tests, and release notes",
    "The custom build system and project structure add friction for new contributors who are accustomed to standard CMake workflows"
  ],
  "best_for": "Experienced graphics engineers building cross-platform rendering pipelines for games or visualization tools that need to ship on PC, console, and mobile from a single codebase",
  "not_ideal_for": "Solo developers, small teams, or beginners looking for a ready-to-use game engine with visual editing tools and approachable documentation",
  "related": ["bgfx", "ogre3d", "nvidia-falcor", "filament", "wicked-engine"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": true,
    "network_rendering": false,
    "hardware_ray_tracing": true,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": true,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 4800,
  "github_stars_trend": [4200, 4280, 4350, 4400, 4450, 4500, 4550, 4600, 4650, 4700, 4750, 4800],
  "commit_activity_52w": [20, 35, 28, 42, 15, 30, 22, 38, 25, 18, 33, 27, 40, 20, 35, 23, 30, 18, 45, 25, 32, 21, 38, 28, 15, 34, 22, 40, 26, 18, 35, 30, 42, 20, 25, 38, 22, 15, 33, 28, 40, 24, 18, 35, 30, 22, 42, 28, 20, 36, 25, 32],
  "contributor_count": 55,
  "open_issues": 35,
  "fork_count": 620,
  "install_command": "git clone https://github.com/ConfettiFX/The-Forge",
  "community_links": {
    "discord": "https://discord.gg/hJS54bz",
    "forum": "https://github.com/ConfettiFX/The-Forge/discussions"
  },
  "tutorials": [
    {
      "title": "The Forge Release Notes and Examples",
      "url": "https://github.com/ConfettiFX/The-Forge/blob/master/README.md",
      "type": "article"
    }
  ]
}
