{
  "id": "threejs",
  "name": "three.js",
  "version": "r170",
  "description": "The most widely used JavaScript library for 3D graphics in web browsers, supporting WebGL and WebGPU",
  "long_description": "three.js is the dominant JavaScript library for creating and displaying 3D content in web browsers. Created by Ricardo Cabello (Mr.doob) in 2010, it abstracts the complexity of WebGL into a scene graph API with cameras, lights, materials, geometries, and post-processing effects. With over 100,000 GitHub stars, it has the largest community, the most third-party integrations, and the widest deployment of any web 3D framework — powering everything from creative coding experiments to production e-commerce configurators, data visualizations, and interactive art installations.\n\nthree.js provides a physically based material system through MeshStandardMaterial and MeshPhysicalMaterial, supporting metallic/roughness workflows, clearcoat, transmission, iridescence, and screen-space subsurface scattering approximations. The library includes an extensive loader ecosystem for glTF, OBJ, FBX, Collada, PLY, STL, and dozens of other formats. Post-processing is available through an EffectComposer pipeline offering bloom, depth of field, SSAO, tone mapping, and more.\n\nThe library is actively transitioning to support WebGPU alongside WebGL, introducing a new node-based material system called TSL (Three.js Shading Language) that enables more expressive and composable shaders. three.js also provides built-in WebXR support for VR and AR experiences, skeletal animation, morph targets, instanced rendering, raycasting, and sprite/particle systems. Its zero-dependency, no-build-step approach means it can be loaded via a single script tag, making it uniquely accessible for rapid prototyping.",
  "technique": ["rasterization"],
  "language": "JavaScript",
  "license": "MIT",
  "platforms": ["web"],
  "gpu_support": true,
  "gpu_apis": ["webgl", "webgpu"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["gltf", "glb", "obj", "fbx", "collada", "3ds", "stl", "ply", "draco", "usdz"],
  "output_formats": ["framebuffer", "png", "jpg"],
  "homepage": "https://threejs.org",
  "repository": "https://github.com/mrdoob/three.js",
  "documentation": "https://threejs.org/docs/",
  "first_release": "2010-04-24",
  "status": "active",
  "tags": [
    "real-time",
    "webgl",
    "webgpu",
    "javascript",
    "browser",
    "3d",
    "pbr",
    "web",
    "creative-coding",
    "data-visualization",
    "cross-platform",
    "webxr"
  ],
  "strengths": [
    "Dominant ecosystem position with the largest community, most examples (~700+ official), and widest third-party library support of any web 3D framework",
    "Extremely low barrier to entry — works in any modern browser with no build step, installation, or plugin required",
    "WebGPU support via the new WebGPU renderer and TSL node-based material system positions it for next-generation web graphics with compute shader access",
    "Comprehensive loader ecosystem supporting virtually every 3D file format through well-maintained addon modules",
    "Battle-tested in production by thousands of websites, agencies, and applications spanning e-commerce, data visualization, art, and gaming"
  ],
  "limitations": [
    "No built-in scene editor — project setup and scene composition require code, though community tools like React Three Fiber, drei, and leva help",
    "API surface is very large and has accumulated legacy patterns over 14+ years of development, making some areas inconsistent",
    "Performance ceiling is constrained by JavaScript's single-threaded execution model and WebGL/WebGPU browser sandbox overhead",
    "Material system is transitioning from legacy shader-based approach to the new TSL node system — documentation is fragmented during this migration",
    "No native support for advanced global illumination — limited to baked lightmaps, environment maps, and screen-space techniques"
  ],
  "best_for": "Web-based 3D experiences, interactive data visualizations, product configurators, and creative coding projects that run directly in the browser without installation",
  "not_ideal_for": "Offline physically based rendering, native desktop/mobile applications requiring maximum GPU performance, or projects needing built-in physics and scene editing tools",
  "related": ["babylonjs", "filament"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": true,
    "motion_blur": false,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": null,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": true,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": true,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["React Three Fiber", "A-Frame", "PlayCanvas"],
  "install_command": "npm install three",
  "community_links": {
    "discord": "https://discord.gg/56GBJwAnUS",
    "forum": "https://discourse.threejs.org/",
    "stackoverflow_tag": "three.js"
  },
  "tutorials": [
    {
      "title": "three.js Manual - Creating a Scene",
      "url": "https://threejs.org/manual/#en/fundamentals",
      "type": "article"
    },
    {
      "title": "Discover three.js",
      "url": "https://discoverthreejs.com/",
      "type": "course"
    }
  ]
}
