{
  "id": "tinyraytracer",
  "name": "tinyraytracer",
  "version": "1.0",
  "description": "Ultra-minimal educational ray tracer in approximately 250 lines of C++ demonstrating core rendering concepts without external dependencies",
  "long_description": "tinyraytracer is an educational ray tracing tutorial by Dmitry V. Sokolov (ssloy) that builds a complete Whitted-style ray tracer in approximately 250 lines of C++ with zero external dependencies. Created in 2019 as part of a series of \"tiny\" educational graphics projects (alongside tinyrenderer for software rasterization and tinykaboom for ray marching), it teaches ray-sphere intersection, Phong lighting, shadow rays, reflections, refractions via Snell's law, procedural checkerboard textures, and environment mapping through a commit-by-commit tutorial structure.\n\nThe tutorial is structured so that each git commit adds exactly one new feature, allowing learners to follow the progression from a blank canvas to a complete scene with reflective and refractive spheres on a checkerboard floor. The output is a TGA image file, and the entire program compiles with a single `g++` invocation. The code deliberately avoids templates, abstractions, and clever optimizations — every line is straightforward and instructional. Unlike Shirley's books which teach path tracing and Monte Carlo methods, tinyraytracer covers only Whitted-style recursive ray tracing with deterministic shading.\n\ntinyraytracer occupies the niche of \"absolute minimum viable ray tracer\" — even more minimal than Ray Tracing in One Weekend. It is designed for complete beginners who want to understand the very basics of ray tracing (ray generation, intersection, reflection, refraction) before progressing to more sophisticated resources. The companion project tinyrenderer teaches software rasterization using the same minimalist philosophy, and together they provide a comprehensive introduction to the two fundamental rendering paradigms.",
  "technique": ["ray_tracing"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["hardcoded"],
  "output_formats": ["tga"],
  "homepage": "https://github.com/ssloy/tinyraytracer",
  "repository": "https://github.com/ssloy/tinyraytracer",
  "documentation": "https://github.com/ssloy/tinyraytracer/wiki",
  "first_release": "2019-01-01",
  "latest_release": "2019-02-01",
  "latest_release_version": "1.0",
  "status": "archived",
  "github_stars": 5200,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 8,
  "open_issues": 10,
  "fork_count": 500,
  "tags": [
    "educational",
    "ray-tracing",
    "minimal",
    "beginner",
    "whitted",
    "tutorial",
    "single-file"
  ],
  "strengths": [
    "Extreme minimalism — the entire ray tracer fits in approximately 250 lines of readable C++ with zero external dependencies, making it the quickest possible entry point for understanding ray tracing",
    "Commit-by-commit tutorial structure isolates each concept (spheres, lighting, shadows, reflections, refractions) so learners can understand each feature independently",
    "Part of a coherent educational ecosystem: tinyrenderer (rasterization), tinyraytracer (ray tracing), and tinykaboom (ray marching) together cover the three fundamental rendering approaches",
    "No build system complexity — a single g++ command compiles the complete program, eliminating all tooling barriers for beginners",
    "The code is deliberately straightforward with no templates, abstractions, or cleverness — pure instructional clarity prioritized over elegance"
  ],
  "limitations": [
    "Covers only Whitted-style recursive ray tracing — does not teach path tracing, Monte Carlo methods, or physically based rendering, limiting its depth as a learning resource",
    "No anti-aliasing, importance sampling, or noise handling means output images have visible aliasing artifacts that production renderers solve",
    "Extremely limited scene complexity — hardcoded spheres and planes only, with no scene description format or ability to load external models",
    "Not maintained or updated — it is a finished tutorial artifact, so no new features, fixes, or community engagement should be expected",
    "Outputs only TGA format, requiring conversion for modern use"
  ],
  "best_for": "Absolute beginners seeking the quickest possible introduction to ray tracing concepts, and students who want to understand ray-sphere intersection and basic lighting before tackling more comprehensive resources",
  "not_ideal_for": "Learning physically based rendering, any practical rendering task, benchmarking, or anyone who already understands basic ray casting",
  "related": ["raytracing-in-one-weekend", "smallpt", "sort"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": false,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": false,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": [],
  "install_command": "git clone https://github.com/ssloy/tinyraytracer && cd tinyraytracer && g++ -O3 tinyraytracer.cpp -o tinyraytracer",
  "community_links": {},
  "citations": [],
  "tutorials": [
    {
      "title": "tinyraytracer Wiki Tutorial",
      "url": "https://github.com/ssloy/tinyraytracer/wiki",
      "type": "article"
    }
  ]
}