{
  "id": "tungsten",
  "name": "Tungsten",
  "version": "git-2018",
  "description": "Lightweight research-oriented physically based renderer with an exceptionally clean codebase and complete integrator set",
  "long_description": "Tungsten is a physically based renderer created by Benedikt Bitterli as a personal research project, with active development primarily spanning 2014 to 2017. It emerged during a period of rapid advancement in physically based rendering techniques and was designed as a clean, readable implementation of modern rendering algorithms — not as a production tool, but as a reference codebase for study and experimentation by graphics researchers and students.\n\nThe renderer implements a remarkably complete set of integrators for a solo-developer project: unidirectional and bidirectional path tracing, progressive and standard photon mapping, Metropolis light transport (primary sample space MLT), light tracing, and vertex connection and merging (VCM). It supports heterogeneous volumetric media, subsurface scattering, motion blur, depth of field, physically based BSDFs, HDRI environment lighting, and geometric instancing. Scenes are defined using a clean JSON-based format, and the renderer optionally leverages Intel Embree for BVH acceleration. The C++ codebase is deliberately structured for readability rather than maximum performance.\n\nWhile Tungsten is no longer actively developed, it remains one of the most frequently cited examples of a well-written, complete physically based renderer by a single author. It is closely associated with Bitterli's widely-used collection of free rendering resources — a set of reference scenes at benedikt-bitterli.me/resources/ that many researchers use for benchmarking and visual comparison. The codebase serves as an excellent companion to the PBRT textbook, offering a more compact and pragmatic perspective on how to implement the same core algorithms.",
  "technique": ["path_tracing"],
  "language": "C++",
  "license": "Zlib",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["json"],
  "output_formats": ["png", "exr", "hdr"],
  "homepage": "https://github.com/tunabrain/tungsten",
  "repository": "https://github.com/tunabrain/tungsten",
  "first_release": "2014-01-01",
  "latest_release": "2018-01-01",
  "status": "archived",
  "github_stars": 1600,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 5,
  "open_issues": 20,
  "fork_count": 250,
  "tags": [
    "research",
    "educational",
    "physically-based",
    "path-tracing",
    "offline",
    "clean-code",
    "reference-implementation",
    "volumetric"
  ],
  "strengths": [
    "Exceptionally clean and readable C++ codebase — widely cited as one of the best examples of how to structure a physically based renderer for study, making it an ideal companion to the PBRT textbook for graduate-level graphics students",
    "Remarkably complete integrator set for a solo-developer project: unidirectional and bidirectional path tracing, vertex connection and merging (VCM), photon mapping, progressive photon mapping, and Metropolis light transport are all implemented and functional",
    "JSON-based scene format is easy to parse and create programmatically, lowering the barrier to writing test scenes compared to custom binary or complex XML formats used by other renderers",
    "Closely associated with Benedikt Bitterli's free rendering resources — a widely-used collection of reference scenes that many researchers use for benchmarking and visual comparison",
    "Permissive zlib license allows unrestricted use including in proprietary and commercial projects without any source disclosure requirements"
  ],
  "limitations": [
    "Development has effectively concluded — the repository has not seen meaningful commits since approximately 2017, and no future updates or maintenance should be expected",
    "CPU-only architecture with no GPU acceleration path means render times for complex scenes are significantly longer than GPU-accelerated alternatives like Cycles or PBRT v4's OptiX backend",
    "No community support infrastructure — no forum, no Discord, no documentation beyond the README, and no tutorials; users must read the source code directly to understand usage and capabilities",
    "Limited scene format ecosystem — while the JSON format is clean, there are few tools for authoring scenes beyond manual JSON editing or the basic Blender exporter script",
    "No ongoing maintenance means potential compatibility issues with modern C++ compilers, operating systems, or dependency versions may go permanently unresolved"
  ],
  "best_for": "Graduate students studying physically based rendering implementation, researchers wanting a clean reference codebase for integrator algorithms (especially VCM and MLT), and developers seeking a well-architected example of a complete renderer",
  "not_ideal_for": "Production rendering, active research requiring ongoing development and support, GPU-accelerated workflows, or users needing documentation and community resources",
  "related": ["pbrt", "mitsuba3", "sort", "smallpt"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": true,
    "metropolis_lt": true,
    "photon_mapping": true,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": true,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": false,
    "python_api": false,
    "c_cpp_api": false,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender"],
  "community_links": {},
  "tutorials": [
    {
      "title": "Bitterli's Rendering Resources (benchmark scenes)",
      "url": "https://benedikt-bitterli.me/resources/",
      "type": "article"
    }
  ]
}