{
  "id": "viskores",
  "name": "Viskores (VTK-m)",
  "version": "2.2.0",
  "description": "Massively parallel visualization toolkit for multi-core and many-core architectures, the next-generation successor to VTK algorithms",
  "long_description": "Viskores, formerly known as VTK-m (VTK-many-core), is a ground-up redesign of VTK's computational visualization algorithms for modern massively parallel hardware. Developed by Kitware in collaboration with Sandia National Laboratories, Oak Ridge National Laboratory, and Los Alamos National Laboratory under US Department of Energy funding, it provides hardware-portable implementations of key visualization algorithms — isosurface extraction, volume rendering, contouring, particle advection, and connected components — that run efficiently on CPUs, NVIDIA GPUs, AMD GPUs, and other many-core architectures.\n\nThe framework's central abstraction is the \"worklet\" — a small, portable function that developers write once and Viskores automatically maps to the target hardware via backend dispatchers for serial execution, TBB, OpenMP, CUDA, and Kokkos. This design enables a single algorithm implementation to run on Intel Xeon processors, NVIDIA A100 GPUs, and AMD MI250X accelerators without code changes. The Flying Edges algorithm for isosurface extraction, developed within this project, is significantly faster than traditional Marching Cubes on both CPU and GPU.\n\nViskores is not a standalone visualization application — it is an infrastructure library designed for integration into VTK, ParaView, and custom HPC visualization pipelines. Its primary use case is in-situ visualization: processing simulation data at the point of generation on the same supercomputer, without intermediate I/O. This capability is critical for exascale computational science where writing full simulation output to disk is prohibitively expensive. The library integrates directly with VTK as a backend filter implementation and is used by ParaView for GPU-accelerated filter execution.",
  "technique": ["volume_rendering"],
  "language": "C++",
  "license": "BSD-3-Clause",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": true,
  "gpu_apis": ["cuda"],
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["vtk", "vti", "vtr"],
  "output_formats": ["vtk", "vti"],
  "homepage": "https://m.vtk.org",
  "repository": "https://github.com/Kitware/VTK-m",
  "documentation": "https://m.vtk.org/index.php/VTK-m_Users_Guide",
  "paper": "https://doi.org/10.1109/MCG.2016.48",
  "paper_bibtex": "@article{moreland2016vtk,\n  title={VTK-m: Accelerating the Visualization Toolkit for Massively Threaded Architectures},\n  author={Moreland, Kenneth and Sewell, Christopher and Usher, William and Lo, Li-Ta and Meredith, Jeremy and Pugmire, David and Kress, James and Schroots, Hendrik and Ma, Kwan-Liu and Childs, Hank and others},\n  journal={IEEE Computer Graphics and Applications},\n  volume={36},\n  number={3},\n  pages={48--58},\n  year={2016},\n  publisher={IEEE},\n  doi={10.1109/MCG.2016.48}\n}",
  "first_release": "2014-01-01",
  "latest_release": "2024-08-01",
  "latest_release_version": "2.2.0",
  "status": "active",
  "github_stars": 700,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 90,
  "open_issues": 300,
  "fork_count": 200,
  "tags": [
    "hpc",
    "parallel",
    "volume-rendering",
    "in-situ",
    "exascale",
    "kitware",
    "scientific-visualization",
    "gpu",
    "many-core"
  ],
  "strengths": [
    "Hardware-portable parallel algorithm framework — write once, run on CPUs (OpenMP/TBB), NVIDIA GPUs (CUDA), and AMD GPUs (Kokkos) without code changes, a rarity in scientific visualization",
    "Backed by US Department of Energy national laboratories with sustained funding and professional engineering support from Kitware, ensuring long-term viability",
    "Flying Edges algorithm for isosurface extraction is significantly faster than traditional Marching Cubes, delivering state-of-the-art performance on both CPU and GPU",
    "Designed for exascale in-situ visualization — can process simulation output at the point of generation without intermediate I/O, critical for petabyte-scale computational science",
    "Clean, modern C++ API with the worklet abstraction that separates algorithm logic from hardware mapping, making it accessible for visualization researchers to add new parallel algorithms"
  ],
  "limitations": [
    "Not a standalone visualization application — it is a library that must be integrated into VTK, ParaView, or custom applications, requiring significant C++ development expertise",
    "Learning curve for the worklet programming model can be steep for developers unfamiliar with data-parallel programming paradigms",
    "Narrower algorithm coverage than full VTK — not all VTK filters have been ported, so some workflows still require fallback to the original VTK serial implementations",
    "Documentation is oriented toward HPC developers and visualization researchers — resources for beginners or non-C++ developers are limited",
    "GPU performance benefits are most apparent on large datasets and HPC workloads; for desktop-scale data, the overhead of GPU memory transfers can negate parallel speedups"
  ],
  "best_for": "HPC visualization developers building in-situ analysis pipelines, Kitware ecosystem integrators accelerating VTK/ParaView with GPU backends, and computational scientists needing portable parallel visualization algorithms",
  "not_ideal_for": "End-user visualization, small datasets, web-based rendering, or anyone seeking a standalone visualization application with a GUI",
  "related": ["vtk", "paraview", "ospray", "embree"],
  "features": {
    "global_illumination": false,
    "path_tracing": false,
    "bidirectional_pt": null,
    "metropolis_lt": null,
    "photon_mapping": null,
    "volumetric": true,
    "subsurface_scattering": false,
    "motion_blur": false,
    "depth_of_field": false,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": null,
    "instancing": false,
    "out_of_core": true,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": true,
    "multi_gpu": true,
    "network_rendering": true,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": false,
    "shadow_mapping": false,
    "screen_space_effects": false,
    "lod_system": false,
    "animation_support": false,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["VTK", "ParaView"],
  "install_command": "git clone https://github.com/Kitware/VTK-m && cd VTK-m && cmake -B build && cmake --build build",
  "community_links": {
    "mailing_list": "https://vtk.org/mailman/listinfo/vtkusers"
  },
  "citations": [
    {
      "title": "VTK-m: Accelerating the Visualization Toolkit for Massively Threaded Architectures",
      "url": "https://doi.org/10.1109/MCG.2016.48",
      "year": 2016
    }
  ],
  "tutorials": [
    {
      "title": "VTK-m User's Guide",
      "url": "https://m.vtk.org/index.php/VTK-m_Users_Guide",
      "type": "article"
    }
  ]
}