{
  "id": "wicked-engine",
  "name": "Wicked Engine",
  "version": "0.71",
  "description": "Modern open-source C++ game engine with Vulkan/DX12 rendering, hardware ray tracing, and a built-in editor",
  "long_description": "Wicked Engine is a modern, open-source 3D game engine created and primarily maintained by János Turánszki. Built from the ground up on Vulkan and DirectX 12 (with DirectX 11 fallback), it delivers a rendering feature set that rivals commercial engines — hardware-accelerated ray tracing, real-time path tracing, volumetric clouds and fog, physically based materials, screen-space global illumination, and a temporal denoiser — all from what is largely a solo developer project.\n\nBeyond rendering, Wicked Engine includes a complete game engine stack: an Entity Component System (ECS), Jolt Physics integration, custom audio, Lua scripting, terrain with procedural generation, video playback, networking, and a built-in editor with transform gizmos, entity inspectors, material editing, and weather/atmosphere controls. The engine imports glTF 2.0 as its primary scene format and supports OBJ for simpler geometry.\n\nThe engine's real-time path tracing mode uses DXR (DirectX Raytracing) and Vulkan RT extensions to produce ground-truth global illumination at interactive frame rates on RTX-class hardware. The accompanying denoiser smooths the noisy path-traced output for real-time use. The clean, well-organized C++ codebase has become a popular learning resource for modern graphics programming, with each rendering feature implemented in clearly structured, readable code. Wicked Engine is MIT-licensed and has attracted a growing community of contributors and users building games and visualization tools.",
  "technique": ["rasterization", "ray_tracing", "path_tracing"],
  "language": "C++",
  "license": "MIT",
  "platforms": ["linux", "windows"],
  "gpu_support": true,
  "gpu_apis": ["vulkan", "directx"],
  "cpu_support": false,
  "real_time": true,
  "scene_formats": ["gltf", "glb", "obj", "custom"],
  "output_formats": ["framebuffer", "png"],
  "homepage": "https://wickedengine.net",
  "repository": "https://github.com/turanszkij/WickedEngine",
  "documentation": "https://github.com/turanszkij/WickedEngine/wiki",
  "first_release": "2015-01-01",
  "latest_release": "2024-10-20",
  "latest_release_version": "0.71",
  "status": "active",
  "tags": [
    "game-engine",
    "vulkan",
    "directx-12",
    "ray-tracing",
    "path-tracing",
    "ecs",
    "editor",
    "physics",
    "real-time",
    "pbr"
  ],
  "strengths": [
    "Remarkably comprehensive feature set for an open-source engine — hardware ray tracing, real-time path tracing, volumetric clouds, physics, audio, networking, terrain, and a full editor from a largely single-developer project",
    "Modern rendering architecture built from the ground up on Vulkan and DirectX 12 with no legacy API baggage, resulting in a clean codebase ideal for learning modern graphics programming",
    "Real-time path tracing mode via DXR/Vulkan RT produces ground-truth global illumination at interactive frame rates on RTX-class hardware, with an integrated temporal denoiser",
    "Clean, well-organized C++ source code that has become a widely-referenced learning resource for Vulkan/DX12 rendering techniques, shader programming, and ECS architecture",
    "MIT license allows unrestricted commercial use, and the active development pace consistently pushes new rendering techniques into the engine"
  ],
  "limitations": [
    "Primarily maintained by a single developer, creating sustainability concerns for teams building production titles on the engine",
    "Smaller ecosystem and community than Godot or established commercial engines — fewer tutorials, asset stores, third-party plugins, and integration guides",
    "Linux support is less mature than Windows, and macOS support is absent due to the engine's reliance on Vulkan and DirectX",
    "Scripting is limited to Lua with no visual scripting or beginner-friendly alternatives, raising the entry barrier for non-C++ developers",
    "Documentation consists primarily of wiki pages and code comments — no comprehensive reference manual or API documentation website exists"
  ],
  "best_for": "Indie game developers and graphics programmers seeking a modern, fully-featured open-source C++ engine with cutting-edge rendering capabilities and DXR ray tracing",
  "not_ideal_for": "Teams needing cross-platform support on macOS/iOS/Web, or non-programmers seeking a visual scripting workflow and extensive beginner documentation",
  "related": ["nvidia-falcor", "godot", "the-forge", "ogre3d", "bevy"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": false,
    "metropolis_lt": false,
    "photon_mapping": false,
    "volumetric": true,
    "subsurface_scattering": true,
    "motion_blur": true,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": true,
    "instancing": true,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": true,
    "gpu_rendering": true,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": true,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": true,
    "pbr_materials": true,
    "hdri_environment": true,
    "shadow_mapping": true,
    "screen_space_effects": true,
    "lod_system": true,
    "animation_support": true,
    "python_api": false,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": true,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "github_stars": 6000,
  "github_stars_trend": [5100, 5200, 5300, 5400, 5500, 5550, 5600, 5700, 5750, 5850, 5900, 6000],
  "commit_activity_52w": [15, 22, 18, 25, 12, 20, 16, 28, 14, 19, 23, 17, 21, 15, 26, 18, 22, 13, 19, 24, 16, 20, 27, 14, 18, 23, 15, 21, 19, 25, 13, 17, 22, 16, 20, 24, 18, 14, 26, 19, 23, 15, 21, 17, 25, 20, 16, 22, 14, 19, 23, 18],
  "contributor_count": 65,
  "open_issues": 45,
  "fork_count": 750,
  "install_command": "git clone https://github.com/turanszkij/WickedEngine && cd WickedEngine && cmake -B build -S . && cmake --build build --config Release",
  "community_links": {
    "discord": "https://discord.gg/CFjRYmE",
    "forum": "https://github.com/turanszkij/WickedEngine/discussions"
  },
  "tutorials": [
    {
      "title": "Wicked Engine Wiki",
      "url": "https://github.com/turanszkij/WickedEngine/wiki",
      "type": "article"
    },
    {
      "title": "Wicked Engine Devblog",
      "url": "https://wickedengine.net/category/devblog/",
      "type": "article"
    }
  ]
}
