{
  "id": "yafray",
  "name": "YafaRay",
  "version": "4.0.0",
  "description": "Classic open-source ray tracer with a long history in the Blender rendering ecosystem",
  "long_description": "YafaRay (Yet Another Free Amazing Raytracer) is an open-source rendering engine with roots dating back to the early 2000s. Originally released as YafRay (Yet Another Free Raytracer) around 2001-2002, the project was rebranded to YafaRay in 2008 when the codebase was substantially rewritten. It holds a notable place in rendering history as one of the first external render engines to integrate with Blender, predating the arrival of Blender Cycles in 2011 and helping establish the ecosystem of third-party Blender rendering addons.\n\nThe renderer now exists as libYafaRay — a rendering library with C and Python bindings. It offers an unusually diverse set of integrators for its size: direct lighting, photon mapping, unidirectional and bidirectional path tracing, and Stochastic Progressive Photon Mapping (SPPM). This flexibility allows users to trade accuracy for speed depending on the scene. It supports subsurface scattering, volumetric media, depth of field, HDRI environment lighting, and various material models including Glossy and ShinyDiffuse BSDFs. Output formats include PNG, JPEG, TGA, HDR, and EXR.\n\nDevelopment has been sporadic in recent years, maintained primarily by a small number of contributors. While YafaRay's Blender integration was once its primary selling point, compatibility with recent Blender versions (3.x and 4.x) is uncertain as the addon has not kept pace with Blender's rapidly evolving Python API. The project's significance is primarily historical — it demonstrated the viability of external rendering engines in Blender and influenced the ecosystem that Cycles and LuxCoreRender would later dominate.",
  "technique": ["path_tracing", "ray_tracing"],
  "language": "C++",
  "license": "LGPL-2.1-only",
  "platforms": ["linux", "macos", "windows"],
  "gpu_support": false,
  "cpu_support": true,
  "real_time": false,
  "scene_formats": ["yafaray-xml"],
  "output_formats": ["png", "jpg", "tga", "hdr", "exr"],
  "homepage": "https://www.yafaray.org",
  "repository": "https://github.com/YafaRay/libYafaRay",
  "documentation": "https://www.yafaray.org",
  "first_release": "2002-01-01",
  "latest_release": "2022-02-01",
  "latest_release_version": "4.0.0",
  "status": "maintenance",
  "github_stars": 400,
  "github_stars_trend": [],
  "commit_activity_52w": [],
  "contributor_count": 15,
  "open_issues": 30,
  "fork_count": 80,
  "tags": [
    "classic",
    "historical",
    "path-tracing",
    "ray-tracing",
    "blender",
    "offline",
    "photon-mapping",
    "lgpl"
  ],
  "strengths": [
    "Historically significant as one of the first external rendering engines to integrate with Blender, helping establish the open-source external renderer ecosystem before Cycles existed",
    "Multiple integrator options — direct lighting, photon mapping, path tracing, bidirectional path tracing, and SPPM — give users flexibility to trade accuracy for speed depending on the scene",
    "LGPL-2.1 license allows linking into proprietary projects without requiring full source disclosure, making it more permissive for embedding than GPL-licensed alternatives",
    "Photon mapping and SPPM integrators enable efficient rendering of caustics in glass and water scenes that pure unidirectional path tracers handle less efficiently",
    "Restructured as libYafaRay with C and Python bindings, enabling programmatic use as a rendering library independent of any specific DCC application"
  ],
  "limitations": [
    "Development has largely stalled — the project receives sporadic maintenance updates but no significant new features, and its long-term future is uncertain",
    "Blender integration may not work with recent Blender versions (3.x/4.x) as the addon has not kept pace with Blender's rapidly changing Python API",
    "CPU-only rendering with no GPU acceleration makes it significantly slower than modern GPU-enabled alternatives like Cycles or LuxCoreRender for complex scenes",
    "Smaller community than any other Blender-ecosystem renderer — finding help, tutorials, or community-created content is difficult",
    "Material system predates modern PBR standards and lacks features like Principled BSDF or Disney material models that contemporary renderers provide"
  ],
  "best_for": "Exploring the history of open-source rendering, projects needing an LGPL-licensed rendering library for embedding, and researchers studying the evolution of Blender rendering integration",
  "not_ideal_for": "Production rendering, modern Blender workflows where Cycles and EEVEE are superior in every practical dimension, GPU-accelerated rendering, or active research",
  "related": ["blender-cycles", "luxcorerender", "povray", "appleseed"],
  "features": {
    "global_illumination": true,
    "path_tracing": true,
    "bidirectional_pt": true,
    "metropolis_lt": false,
    "photon_mapping": true,
    "volumetric": false,
    "subsurface_scattering": true,
    "motion_blur": false,
    "depth_of_field": true,
    "spectral_rendering": false,
    "polarization": false,
    "caustics": true,
    "instancing": false,
    "out_of_core": false,
    "adaptive_sampling": false,
    "denoiser_builtin": false,
    "gpu_rendering": false,
    "multi_gpu": false,
    "network_rendering": false,
    "hardware_ray_tracing": false,
    "differentiable": false,
    "inverse_rendering": false,
    "neural_acceleration": false,
    "real_time_preview": false,
    "pbr_materials": false,
    "hdri_environment": true,
    "shadow_mapping": null,
    "screen_space_effects": null,
    "lod_system": false,
    "animation_support": true,
    "python_api": true,
    "c_cpp_api": true,
    "rust_api": false,
    "javascript_api": false,
    "scene_editor_gui": false,
    "plugin_system": false,
    "open_shading_language": false,
    "materialx": false
  },
  "integrations": ["Blender"],
  "community_links": {
    "stackoverflow_tag": "yafray"
  },
  "tutorials": []
}